sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c

//===========================================================
// INCLUDES
//===========================================================
#include "nora_spi_i2s_tdm_conf.h"

#include <xc.h>
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
// The silicon layer (SPIxCON1/BRG register writer, the s_spi_dev[] device-facts table,
// per-SPI DMA-channel config) lives in nora_spi_i2s_tdm_hw.*, and the block
// counters + ISR load/time monitor in nora_spi_i2s_tdm_diag.*. So the transport
// core no longer pulls the SPI register masks (reg.h), high-res timer, debug GPIO, or
// <stdio.h> -- it orchestrates instances and runs the block ISR, delegating register
// pokes to hw.* and diagnostics to diag.*.
#include "nora_dma.h"
// The RX-block ISR body is a measured hot path, so it uses the `_hot` inlines. Including
// this header is that declaration; the non-ISR paths in this file (the public TX-fill
// pointer query, the RX-IE guard around start/stop) deliberately keep calling the
// out-of-line twins in nora_dma.h.
#include "nora_dma_dspic33ck_fast.h"
#include "nora_spi_i2s_tdm.h"
#include "nora_spi_i2s_tdm_dspic33ck_hw.h"      // silicon layer: tdm_spi_inst_t + register/DMA ops
#include "nora_spi_i2s_tdm_dspic33ck_fs_clc.h"  // CLC1 50%-FS generator (TDM master + FS_50PCT)
#include "nora_spi_i2s_tdm_diag.h"    // block counters + ISR load/time monitor (separated)
#include "nora_spi_i2s_tdm_dspic33ck_diag_fast.h" // the same diag's per-block ISR `_hot` hooks
#if NORA_TDM_SUMPROF
// The TDMsum hooks need the raw counter directly (the per-leg monitor reaches it through
// diag.c). Only the profiler needs it here, so the include follows the same switch.
#include "nora_high_res_timer.h"
#endif




//===========================================================
// Definition
//===========================================================
// Unknown-device guard is centralized in nora_spi_i2s_tdm.h: the
// NORA_SPI_I2S_TDM_DSPIC33CK_DEVICE derivation #error's on any unsupported device.


// DMA global address-window values are owned by the DMA HAL
// (NORA_DMA_ADDR_LIMIT_LOW / _HIGH in nora_dma_dspic33ck.c), set by
// nora_dma_global_init(). SPI-TDM keeps only per-channel cfg values.




// Debug switches live with their code now: the DMA-config-error printf in the silicon
// layer (nora_spi_i2s_tdm_dspic33ck_hw.c) and the scope-GPIO/load monitor in the diagnostics
// module (nora_spi_i2s_tdm_dspic33ck_diag.c) each carry their own ENA_TDM_DBG. The transport
// core compiles with no printf/GPIO dependency.

// Per-instance DMA channel assignment comes from conf.h (NORA_TDM_SPIn_*_DMA);
// the core no longer hardcodes DMA channel index constants.

#define TDM_ARRAY_SIZE(a) (sizeof(a) / sizeof((a)[0]))
#define TDM_COMPILEASSERT(exp) extern int tdm_compile_assert[(exp) ? 1 : -1] __attribute__((unused))




//--------------------------------------------







//===========================================================
// Enum & Struct typedef
//===========================================================

// tdm_spi_inst_t (physical SPI instances) + the silicon device-facts table live in the
// silicon layer (nora_spi_i2s_tdm_hw.*). The transport core indexes its own leg
// table with the leg-index enum below and stores the physical SPI in each leg's spi_inst.
//
// Explicit dense leg-index enum: one TDM_SPI_LEG_<name> per leg the build carries, in
// table order, terminated by TDM_SPI_LEG_COUNT (= the built-in leg count). Leg 0 is the
// block-timing reference. Used only inside the core (leg table / inst() / spi1()/spi2()),
// so it lives here rather than in a shared header.
//
// This enum, the ping-pong buffers, the s_spi_legs[] table and the RX interrupt vectors
// were formerly GENERATED from a NORA_TDM_INSTANCE_LIST X-macro in conf.h. They are
// now written out directly, keyed off the per-leg conf.h knobs (NORA_TDM_USE_SPI2,
// NORA_TDM_SPIn_RX/TX_DMA, NORA_TDM_SPIn_SYNC_DOMAIN) and the stream geometry
// (NORA_TDM_SLOTS_PER_FS / _BLOCK_FRAMES), so conf.h no longer owns the topology --
// it supplies per-leg values and the core owns the shape. Adding a leg means adding its
// four blocks here plus its channel/domain macros in conf.h.
typedef enum {
    TDM_SPI_LEG_SPI1 = 0,
#if NORA_TDM_USE_SPI2
    TDM_SPI_LEG_SPI2,
#endif
    TDM_SPI_LEG_COUNT
} tdm_spi_leg_index_t;

// TDM_SPI_LEG_BLOCK_REF is the block-timing REFERENCE leg (leg 0) -- NOT a clock master.
// It owns the RX-block ISR that defines the block boundary and is what the singleton
// is_running()/get_status()/get_load() report. The clock role (master/slave) is a
// separate, per-instance concern carried in nora_spi_i2s_tdm_config_t.clock_role. The
// current co-clocked topology requires exactly one BLOCK_REF, and it must be leg 0.
#define TDM_SPI_LEG_BLOCK_REF   0   // first leg is the block-timing reference

// Private SPI leg descriptor == the public opaque instance handle
// (nora_spi_i2s_tdm_inst_t). One physical SPI leg per row owns the SPI
// peripheral, RX/TX DMA channels, ping-pong buffers, its own block callback, and
// its own diagnostics. Each instance's RX-block ISR delivers ONLY this instance's
// RX/TX block to this instance's callback.
struct nora_spi_i2s_tdm_inst_s {
    tdm_spi_inst_t spi_inst;
    nora_dma_channel_t rx_dma_ch;
    nora_dma_channel_t tx_dma_ch;
    /*
     * Cached before DMA/SPI are enabled by inst_start().  The generic silicon
     * table maps spi_inst -> SPIxSTATL, but doing that table lookup for every
     * completed block made framed-error sampling an out-of-line ISR call.  A
     * valid leg has one immutable physical SPI, so cache its status-register
     * address once and let the ISR perform only the required volatile read and
     * W0C-safe acknowledgement.  Never expose this pointer outside the HAL.
     */
    volatile uint16_t *spi_statl;
    // Wire slots, NOT int32_t samples: the DMA boundary is 16-bit wire words on this part.
    // See nora_tdm_slot_t for the wire-order representation.
    nora_tdm_slot_t *rx_buffer;
    nora_tdm_slot_t *tx_buffer;
    uint32_t       buffer_slot_count;   // total SLOTS (2 * slots * blk) -- both ping+pong
    uint8_t        geom_slots_per_fs;   // THIS leg's compile-time slots/FS (buffer geometry)
    uint16_t       geom_block_frames;   // THIS leg's compile-time frames per ping/pong half
    nora_spi_i2s_tdm_config_t config;         // includes this leg's OWN clock role
    bool           config_valid;
    // Block-timing / singleton-reporting REFERENCE leg (leg 0). Each leg
    // already times itself via its own RX-block ISR (P1/P2), so this is NOT a clock-role
    // flag (clock role is per-leg in config, P3 Stage 1) and NOT a hard timing coupling --
    // it only marks which leg is_running()/get_status()/is_active() report and which RX
    // block the demo treats as primary. (When per-instance clocks land -- P3 Stage 2 --
    // the "exactly one, leg 0" topology rule generalizes; today the stream is co-clocked.)
    bool           is_block_timing_master;
    /*
     * Co-clocked grouping: legs that share one BCLK/FS carry the SAME id. A THIRD axis,
     * orthogonal to both neighbours above -- is_block_timing_master says who defines the
     * block boundary, config.clock_role says who DRIVES the clock, and this says who rides
     * the SAME clock. A domain holds at most one CLOCK_MASTER; two legs on independent
     * clocks are different domains even if both are masters.
     *
     * Seeded from conf.h at build time and overwritten by configure_system() (phase 4),
     * which is what makes the caller's topology table the runtime source of truth. Range
     * 0..31 -- start_all_domains() dedups and rolls back through a 32-bit domain mask, and
     * that limit is enforced at both entry points as well as by a compile assert per row.
     */
    uint8_t        sync_domain;
    nora_spi_i2s_tdm_block_cb_t block_cb;     // this instance's block callback
    void                            *block_user;   // opaque user pointer for block_cb
    nora_spi_i2s_tdm_diag_t     diag;         // this instance's counters + ISR load monitor
    volatile bool                    running;      // this instance started (inst_start..inst_stop)
};
typedef struct nora_spi_i2s_tdm_inst_s tdm_spi_leg_t;

typedef struct
{
    tdm_spi_leg_t                      *legs;
    uint8_t                             leg_count;
    const nora_spi_i2s_tdm_port_t *port;

