sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
    /*
     * ENGINE-WIDE open state: set by a successful open(), cleared by close(). It is a
     * property of the SHARED port (external clock + pins + CLC), which is why it lives
     * here and not per leg -- open() brings that up once for every leg.
     *
     * It is what turns four bool return types into load-bearing gates (phase 2): the port
     * may not be swapped while open (set_port), a config may not be committed while open
     * (inst_configure -- open() derives the clock role FROM that config), a leg may not be
     * armed while closed (inst_start -> ERR_NOT_OPEN), and close() may not run under a live
     * stream. Deliberately separate from each leg's `running`: open means "the shared port
     * is routed and its clock was ready", not "audio is moving".
     */
    bool                                opened;

    // Block callback, diagnostics, and the running flag are now owned PER INSTANCE
    // (in tdm_spi_leg_t), not by the stream, so SPI1 and SPI2 each deliver their own
    // block, measure their own ISR load, and start/stop independently.
} tdm_stream_t;


//===========================================================
// Function Prototype
//===========================================================

// pin routing + CLC pass-through live on the board adapter and are reached
// through the registered port callbacks, NOT called by name -- the core no
// longer includes audio_app_board.h.

// Silicon-layer SPI register/DMA ops (tdm_spi_apply_config, *_dma_trigger_enable,
// *_module_enable, *_irq_*, *_soft_stop, *_dma_config) now live in the hw module and
// are reached as nora_spi_i2s_tdm_hw_*() taking a tdm_spi_inst_t + raw fields.

// Per-instance teardown/clear helpers (one physical SPI's own DMA buffers/channels).
static void        tdm_inst_clear_buffers( const tdm_spi_leg_t *leg );
static void        tdm_inst_soft_stop_dma( const tdm_spi_leg_t *leg );
static void        tdm_inst_stop_impl( tdm_spi_leg_t *leg );
// Start, split at the SPIEN boundary (phase 4). Both private: publishing go() would let a
// caller enter SPIEN in an order that has never been shown to bring the FS/CLC master up.
static bool        tdm_inst_arm( tdm_spi_leg_t *leg );
static void        tdm_inst_go( tdm_spi_leg_t *leg );
// Sync-domain helpers (phase 4). All private: the domain state is derived from the leg table
// on demand, never stored, so no getter can go stale.
static bool        tdm_domain_framing_matches( const nora_spi_i2s_tdm_config_t *a,
                                               const nora_spi_i2s_tdm_config_t *b );
static void        tdm_stop_domain_impl( uint8_t domain );
static void        tdm_stop_all_domains_impl( void );
static void        tdm_inst_clear_dma_flags( const tdm_spi_leg_t *leg );
static void        tdm_zero_memory(void *ptr, size_t bytes);
static bool        tdm_spi_leg_is_valid( const tdm_spi_leg_t *leg );
static bool        tdm_stream_topology_is_valid( const tdm_stream_t *stream );
static const tdm_spi_leg_t *tdm_stream_get_block_timing_master_leg( const tdm_stream_t *stream );
static bool        tdm_spi_leg_get_effective_config( const tdm_spi_leg_t *leg,
                                                     nora_spi_i2s_tdm_config_t *effective_cfg );
// Open/running state machine (phase 2). Both are needed by set_port(), the file's first
// global function, so they are declared here with the rest.
static bool        tdm_any_leg_running( void );
// Configure-ownership mode (phase 3): is this leg the one the per-leg SINGLE API may touch?
static bool        tdm_inst_is_primary( const tdm_spi_leg_t *leg );
static bool        tdm_stream_ready_for_start( void );

// RX-DMA IE bracket, config-envelope validation, and the per-instance RX-block ISR
// body. Definitions live in the Local Function section; forward-declared here so the
// global readers (get_load/get_status) and the ISR wrappers above their definitions
// resolve them. tdm_rx_ie_*/tdm_rx_block are static inline (folded in the hot path).
static inline bool tdm_rx_ie_disable( nora_dma_channel_t rx_dma_ch );
static inline void tdm_rx_ie_restore( nora_dma_channel_t rx_dma_ch, bool was_enabled );
static bool        tdm_config_is_supported( const tdm_spi_leg_t* leg, const nora_spi_i2s_tdm_config_t* cfg );
// The last-error latch sits with the other diagnostics further down, but set_port() -- the
// first global function in the file -- now records ERR_NONE on success like every other
// bool-returning entry point, so the setter is forward-declared here.
static inline void tdm_set_error( nora_spi_i2s_tdm_error_t err );
// `always_inline` is intentional.  Under the project's -Os build, plain
// `static inline` was outlined as a 318-byte helper and the DMA vector called
// it.  That made rx_ch/tx_ch runtime parameters, defeating the DMA HAL's
// compile-time channel folding.  The generated vector owns one fixed channel
// and one fixed block geometry, so duplicating this body is the correct
// code-size-for-deadline trade here.
static inline __attribute__((always_inline)) void
tdm_rx_block( tdm_spi_leg_t* inst, nora_dma_channel_t rx_ch, nora_dma_channel_t tx_ch, uint32_t half_pos );




static inline void  tdm_get_src_ptr( nora_dma_status_t dma_stat,
                                       const nora_tdm_slot_t*  const pRxDat,
                                       uint32_t        half_pos,
                                       const nora_tdm_slot_t** src_pptr );
static inline void  tdm_get_dest_ptr( uint32_t dma_tx_addr, nora_tdm_slot_t* const pTxDat, uint32_t half_pos, nora_tdm_slot_t** dest_pptr );
// local_copy_to_CODEC / local_drc_df2t_path / local_filter_cascade_chm were
// moved to audio_app.c. The latter two are declared in audio_app.h.





//===========================================================
// Variables
//===========================================================

#define DMA_BUF_PING_POS     (0)   // ping half is always at offset 0; pong half = slots*blk per leg

// Per-instance ping/pong half size (words) = slots * blk for THIS row. Both the buffer
// size (2 * half) and the ISR's pong-half offset derive from it; passed as a compile-
// time literal into the generated ISR bodies so the hot-path pointer math stays folded.
#define TDM_LEG_HALF_SLOTS(slots, blk)   ((slots) * (blk))

