sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
// Per-instance RX/TX ping-pong buffers, one explicit Rx_<name>/Tx_<name> pair per leg.
// Each is 2 * slots * blk words (Ping + Pong) using THIS leg's slots/blk, so a leg may
// carry its own geometry (both default legs take the stream-wide macros). The names
// follow the leg names so the leg table can wire them per leg.
static nora_tdm_slot_t    Tx_SPI1[ 2 * TDM_LEG_HALF_SLOTS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) ] __attribute__((aligned(4)));  /* 2: Ping/Pong */
static nora_tdm_slot_t    Rx_SPI1[ 2 * TDM_LEG_HALF_SLOTS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) ] __attribute__((aligned(4)));  /* 2: Ping/Pong */
#if NORA_TDM_USE_SPI2
static nora_tdm_slot_t    Tx_SPI2[ 2 * TDM_LEG_HALF_SLOTS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) ] __attribute__((aligned(4)));  /* 2: Ping/Pong */
static nora_tdm_slot_t    Rx_SPI2[ 2 * TDM_LEG_HALF_SLOTS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) ] __attribute__((aligned(4)));  /* 2: Ping/Pong */
#endif

// the application DSP float work buffers (f_A_Data, f_A_Data_chm,
// f_B_Data_chm) live in the demo app (audio_app.c), which owns AND
// clears them (before start()). The HAL core only owns/clears its DMA ping-pong
// buffers (the Rx_<name>/Tx_<name> pair per instance).




// RB15 / USB audio clock state and ISR moved to audio_app_board.c.


//===========================================================
// DMA channel + SPI allocation
//
// The DEVICE FACTS table (s_spi_dev[]: SPIxBUF/CON1/BRG/IMSK + DMA trigger CHSELs +
// CPU IRQ bits, indexed by tdm_spi_inst_t) lives in the silicon layer
// (nora_spi_i2s_tdm_hw.*). Here the transport core keeps only its DRIVER
// ALLOCATION: s_spi_legs[], one physical SPI leg per row with the SPI instance, RX/TX
// DMA channels, owned ping-pong buffers, and current logical config. start() passes
// each leg's spi_inst + DMA channels/buffers down to the hw_* ops.
//===========================================================

// One explicit row per leg: physical SPI + RX/TX DMA channels + its own Rx_<name>/Tx_<name>
// ping-pong buffers. Leg 0 gets is_block_timing_master=1 (the singleton-reporting block
// reference); every other leg gets 0. Each leg's CLOCK role is NOT forced here -- it comes
// from the leg's own config (set by the integrator per leg: a follower is configured SLAVE
// because it rides the shared clock, not because the HAL forces it). The sync_domain value
// here is only the build-time SEED; configure_system() overwrites it from the caller's
// topology table, which is the runtime source of truth (see conf.h).
static tdm_spi_leg_t s_spi_legs[] =
{
    [TDM_SPI_LEG_SPI1] =
    {
        .spi_inst               = TDM_SPI1,
        .rx_dma_ch              = (NORA_TDM_SPI1_RX_DMA),
        .tx_dma_ch              = (NORA_TDM_SPI1_TX_DMA),
        .rx_buffer              = Rx_SPI1,
        .tx_buffer              = Tx_SPI1,
        .buffer_slot_count      = TDM_ARRAY_SIZE(Rx_SPI1),
        .geom_slots_per_fs      = (uint8_t)(NORA_TDM_SLOTS_PER_FS),
        .geom_block_frames      = (uint16_t)(NORA_TDM_BLOCK_FRAMES),
        .is_block_timing_master = 1,   // leg 0 = block-timing reference (NOT the clock role)
        .sync_domain            = (uint8_t)(NORA_TDM_SPI1_SYNC_DOMAIN),
        .block_cb               = NULL,
        .block_user             = NULL,
        .diag                   = { .isr_min_count = 0xFFFFFFFFUL },  /* rest zero; start() calls diag_reset() */
    },
#if NORA_TDM_USE_SPI2
    [TDM_SPI_LEG_SPI2] =
    {
        .spi_inst               = TDM_SPI2,
        .rx_dma_ch              = (NORA_TDM_SPI2_RX_DMA),
        .tx_dma_ch              = (NORA_TDM_SPI2_TX_DMA),
        .rx_buffer              = Rx_SPI2,
        .tx_buffer              = Tx_SPI2,
        .buffer_slot_count      = TDM_ARRAY_SIZE(Rx_SPI2),
        .geom_slots_per_fs      = (uint8_t)(NORA_TDM_SLOTS_PER_FS),
        .geom_block_frames      = (uint16_t)(NORA_TDM_BLOCK_FRAMES),
        .is_block_timing_master = 0,   // follower: rides leg 0's block boundary
        .sync_domain            = (uint8_t)(NORA_TDM_SPI2_SYNC_DOMAIN),
        .block_cb               = NULL,
        .block_user             = NULL,
        .diag                   = { .isr_min_count = 0xFFFFFFFFUL },  /* rest zero; start() calls diag_reset() */
    },
#endif
};

static tdm_stream_t s_stream =
{
    .legs           = s_spi_legs,
    .leg_count      = (uint8_t)TDM_ARRAY_SIZE(s_spi_legs),
    .port           = NULL,
    .opened         = false,
};

// The registered board/clock port is owned by the singleton stream context.
// The table is held by pointer, not copied, so the caller must provide a
// static/long-lived object. NULL is the board-free default: no pin routing,
// no external clock gate, and no clock-change events.

// Block-completion callback ownership lives PER INSTANCE (tdm_spi_leg_t.block_cb).
// Each instance's RX-block ISR invokes its own callback for each completed block;
// if NULL, that instance runs no app/DSP path and start()'s zeroed TX half stays
// silent until a callback fills it. Register before start(), do not clear while
// running; set_block_callback() updates the pair under that instance's RX DMA IE mask.

// Stream-health counters and the ISR load/time monitor live in the separated
// diagnostics module (nora_spi_i2s_tdm_diag.*); each instance (tdm_spi_leg_t)
// holds its own nora_spi_i2s_tdm_diag_t and updates it ONLY through the diag_*
// functions. Each instance's RX-block ISR feeds its diag (note_block / check_deadline
// / isr_begin / isr_end); start() resets every instance's diag. The singleton
// get_load()/get_status() report the block-timing-reference instance's diag under its
// RX DMA IE mask because 32-bit reads are non-atomic on this 16-bit core. The
// deadline metric is software/real-time, not SPIROV/SPITUR hardware status.

// Lifecycle running state is owned PER INSTANCE (tdm_spi_leg_t.running): set by a
// successful inst_start() and cleared by inst_stop(), exposed via
// inst_get_status().running and (for the block-timing reference) is_running(). This is
// deliberately separate from is_active(), which reports clock/source readiness.

// The leg table must have at least the BLOCK_REF row and not exceed the silicon SPI count.
TDM_COMPILEASSERT( TDM_ARRAY_SIZE(s_spi_legs) >= 1u );
TDM_COMPILEASSERT( TDM_ARRAY_SIZE(s_spi_legs) <= (size_t)TDM_SPI_INST_COUNT );

// Per-instance geometry sanity (compile-time), one set per leg: slots/blk fit their leg
// fields (uint8_t / uint16_t), the 2*slots*blk word count cannot overflow int32 indexing,
// and the leg's buffer is exactly that size. The default legs use stream-wide macros
// already range-checked in conf.h; these asserts also cover a leg given its own slots/blk,
// so the per-instance geometry promise has teeth. Kept as a macro over (name, slots, blk)
// so the five checks are stated once and each leg is one line -- this is a repetition of
// identical checks, not the retired topology list: it declares no leg and no channel.
#define TDM_LEG_GEOM_ASSERTS(name, slots, blk, dom)                                       \
    TDM_COMPILEASSERT( (slots) > 0 && (slots) <= 255 );                                   \
    TDM_COMPILEASSERT( (blk)   > 0 && (blk)   <= 65535 );                                 \
    TDM_COMPILEASSERT( (slots) <= (2147483647 / (2 * (blk))) );                           \
    TDM_COMPILEASSERT( TDM_ARRAY_SIZE(Rx_##name) == (2u * (slots) * (blk)) );              \
    TDM_COMPILEASSERT( (dom)   >= 0 && (dom)   < 32 )  /* 32-bit domain mask in start_all_domains() */

TDM_LEG_GEOM_ASSERTS( SPI1, NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES,
                      NORA_TDM_SPI1_SYNC_DOMAIN );
#if NORA_TDM_USE_SPI2
TDM_LEG_GEOM_ASSERTS( SPI2, NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES,
                      NORA_TDM_SPI2_SYNC_DOMAIN );
#endif


