sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
/*
 * Which API family owns the committed configuration.
 *
 * Set by whichever configure entry committed last and NEVER cleared by close() (a closed
 * stream keeps its committed shape, so the next open()->start uses the same API family --
 * that is what makes the console's stop -> close -> open -> start restart work).
 *   NONE   : nothing configured yet -- only reachable before the first configure of either kind.
 *   SINGLE : committed via inst_configure() -> the per-leg PRIMARY-only API
 *            (inst_configure / inst_start / inst_stop) is in force.
 *   SYSTEM : committed via configure_system() -> the whole-system domain API
 *            (configure_system / start_domain / start_all_domains / stop_domain /
 *            stop_all_domains) is in force.
 * configure_system() may full-recommit from ANY mode (NONE/SINGLE/SYSTEM) while CLOSED and
 * fully stopped -- it is the only escape from SINGLE ownership. Once SYSTEM, inst_configure()
 * is rejected (a system caller must stay transactional).
 */
typedef enum {
    TDM_CONFIG_MODE_NONE = 0,
    TDM_CONFIG_MODE_SINGLE,
    TDM_CONFIG_MODE_SYSTEM,
} tdm_config_mode_t;

// Private to this file BY DESIGN: the mode is not a public query. What callers see is the
// ERR_CONFIG_MODE verdict, so no consumer can branch on the mode and re-derive the policy.
static tdm_config_mode_t s_config_mode = TDM_CONFIG_MODE_NONE;

/*
 * Is this leg the stream's PRIMARY leg -- the only leg the per-leg SINGLE API may touch?
 *
 * On CK the primary leg is the block-timing reference (the row whose RX DMA block IRQ
 * drives the app callback), which is the same leg open() already derives the clock role
 * from. A non-primary (follower) leg is reachable only through the whole-system API, so
 * the per-leg calls reject it rather than half-configuring a co-clocked pair one leg at a
 * time -- the failure mode where SPI2 rides framing that SPI1's config never agreed to.
 */
static bool tdm_inst_is_primary( const tdm_spi_leg_t *leg )
{
    return ( leg != NULL ) && ( leg == tdm_stream_get_block_timing_master_leg( &s_stream ) );
}


// Is any leg currently streaming? Backs the close() and set_port() "not while streaming"
// guards. Asks every leg, not the block-timing reference: a follower left running is
// exactly the case those two guards exist to refuse, and is_running() would not see it.
static bool tdm_any_leg_running( void )
{
    const uint8_t n = s_stream.leg_count;
    for( uint8_t i = 0u; i < n; i++ )
    {
        if( s_stream.legs[i].running )
        {
            return true;
        }
    }
    return false;
}




//===========================================================
// Global Function
//===========================================================

// DMA global init/validate were removed in favor of the low-level DMA HAL.
// main() calls nora_dma_global_init() once at startup; the per-channel
// config below checks nora_dma_channel_config()/_enable() return values.


/*
 * Register the board/clock adapter used by this HAL.
 *
 * The table is stored by pointer, not copied, so the caller must provide a
 * static/long-lived object. Passing NULL returns the HAL to its board-free
 * default: no pin routing, no clock gate, and no clock-change events.
 *
 * Rejected (false, port UNCHANGED) while the port is already open()'d or any leg is
 * running: open() consumes the port hooks (clock/pins/CLC), so swapping the port after
 * open -- or under a live stream -- would leave the routed hardware disagreeing with the
 * registered hooks. Call it before open() (typically once at init).
 */
bool nora_spi_i2s_tdm_set_port( const nora_spi_i2s_tdm_port_t* port )
{
    if( s_stream.opened || tdm_any_leg_running() )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_ALREADY_OPEN );
        return false;
    }
    s_stream.port = port;
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


/*
 * Report whether the external stream source is ready.
 *
 * This is a readiness gate, not a running-state check. With a registered port it
 * asks clock_source_ready(role); without a port it returns true so the HAL can
 * run as a self-clocked/no-gate transport.
 */
bool nora_spi_i2s_tdm_is_active( void )
{
    const tdm_stream_t *stream = &s_stream;

    // Stream-readiness gate routed through the clock port. No port (or no
    // clock_source_ready hook) => always ready (self-clocked, no external gate).
    // A board may wire this to an external audio-clock readiness signal.
    // Pass the configured role. Before the first configure(), treat the transport
    // explicitly as SLAVE instead of relying on enum zero-initialization.
    if( ( stream->port != NULL ) && ( stream->port->clock_source_ready != NULL ) )
    {
        const tdm_spi_leg_t *timing_leg = tdm_stream_get_block_timing_master_leg( stream );
        nora_spi_i2s_tdm_clock_role_t role =
            ( ( timing_leg != NULL ) && timing_leg->config_valid ) ? timing_leg->config.clock_role
                                                                    : NORA_SPI_I2S_TDM_CLOCK_SLAVE;
        return stream->port->clock_source_ready( role );
    }
    return true;
}


/*
 * Re-check the clock-readiness gate immediately before a start (arm).
 *
 * open() checks readiness ONCE; between open() and start() an external BCLK/FS could drop.
 * inst_start() calls this just before arming so a stream is not entered with the source
 * already gone. Same gate as is_active() / open(): keyed on the block-timing reference's
 * role and routed through the port. A self-clocked master (no port, or no
 * clock_source_ready hook) is always ready. Returns true = go.
 *
 * READINESS SCOPE (by design, same as canonical): ENGINE-WIDE and keyed on the block-timing
 * reference, NOT per leg -- a follower rides the reference's clock, so there is one source to
 * be ready. A per-leg readiness hook is not supported and should be revisited before this HAL
 * is used for genuinely independent async legs.
 *
 * A named one-line wrapper rather than calling is_active() at the start site, because the two
 * questions differ in intent and only this one is a gate: is_active() answers an application's
 * "may I try?", this answers the HAL's "am I still allowed to arm?". Canonical draws the same
 * line in the same place.
 */
static bool tdm_stream_ready_for_start( void )
{
    return nora_spi_i2s_tdm_is_active();
}


