sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
/*
 * Report the engine's running state = the block-timing reference instance (SPI1).
 *
 * Set by a successful inst_start() of the block-timing reference and cleared by its inst_stop(). It
 * is separate from is_active(), which only means the clock/source gate is ready. For
 * a specific instance use inst_get_status().running.
 */
bool nora_spi_i2s_tdm_is_running( void )
{
    return s_spi_legs[TDM_SPI_LEG_BLOCK_REF].running;
}


/*
 * Read and clear the next external-clock stop/resume event.
 *
 * Clock detection lives in the board adapter and is reached through the port
 * hook. The app consumes this edge to run a mute-bounded stop/reconfigure/restart
 * sequence; without a hook, the HAL reports NONE.
 */
nora_spi_i2s_tdm_clock_event_t nora_spi_i2s_tdm_consume_clock_event( void )
{
    const tdm_stream_t *stream = &s_stream;

    // Routed through the clock port. No port (or no hook) => NONE (no external
    // clock to detect). A board may wire this to an RB15/CN edge or equivalent event.
    if( ( stream->port != NULL ) && ( stream->port->consume_clock_event != NULL ) )
    {
        return stream->port->consume_clock_event();
    }
    return NORA_SPI_I2S_TDM_CLOCK_EVENT_NONE;
}


// The transport is RATE-AGNOSTIC: it moves 32-bit words at whatever BCLK/FS the
// configured BRG (master) or the external clock (slave) provides, and never derives
// anything from a sample-rate value. So the old rate API
// (is_supported_sample_rate / notify_sample_rate / get_sample_rate /
// set_rate_callback + the rate_state machine + rate-change callback) has been removed.
// Sample-rate POLICY is not a HAL property at all -- the supported-rate set is the
// product/board's (APP_SAMPLE_RATE_IS_SUPPORTED in the app layer, used by the CMSIS-SAI
// wrapper to validate ARM_SAI AUDIO_FREQ). Any runtime rate DETECTION (e.g. from a
// USB-audio clock notification or an FS measurement) and the stop->reconfigure->start
// it would drive belong in the application, not here.


/*
 * Number of SPI instances this build has (the size of the instance list in conf.h).
 * Pair with inst(i) to enumerate: for i in 0 .. instance_count()-1.
 */
uint8_t nora_spi_i2s_tdm_instance_count( void )
{
    return s_stream.leg_count;
}

/*
 * Return the handle for one SPI instance, or NULL if index is out of range.
 *
 * index is a leg index in list order (0 = the block-timing reference); the TDM_SPI_LEG_*
 * names are core-internal. The handle is the address of the static SPI leg descriptor.
 * spi1()..spi4() below are NOT wrappers over an index -- they search for a physical SPI.
 */
nora_spi_i2s_tdm_inst_t* nora_spi_i2s_tdm_inst( uint8_t index )
{
    if( index >= (uint8_t)TDM_SPI_LEG_COUNT )
    {
        return NULL;
    }
    return &s_spi_legs[index];
}

/*
 * Find the leg driving one LITERAL physical SPI, or NULL if no leg in this build does.
 *
 * This is the canonical spiN() semantic and it is deliberately a search, not an index:
 * spi2() must mean "the leg on SPI2" even if a future instance list puts SPI2 first, or
 * lists SPI3 without SPI2. The old form returned inst(TDM_SPI_LEG_SPI2), which was really
 * "the second row" and only agreed with the physical number because the default list
 * happens to be SPI1-then-SPI2 -- a coincidence, and one a reordered conf.h would break
 * silently. The loop is over at most TDM_SPI_INST_COUNT (3) rows and these accessors are
 * setup-path only, never in the block ISR.
 */
static nora_spi_i2s_tdm_inst_t* tdm_find_leg_by_phys_spi( tdm_spi_inst_t phys )
{
    for( uint8_t i = 0u; i < (uint8_t)TDM_SPI_LEG_COUNT; ++i )
    {
        if( s_spi_legs[i].spi_inst == phys )
        {
            return &s_spi_legs[i];
        }
    }
    return NULL;   // this build has no leg on that physical SPI
}

nora_spi_i2s_tdm_inst_t* nora_spi_i2s_tdm_spi1( void )
{
    return tdm_find_leg_by_phys_spi( TDM_SPI1 );
}

nora_spi_i2s_tdm_inst_t* nora_spi_i2s_tdm_spi2( void )
{
    return tdm_find_leg_by_phys_spi( TDM_SPI2 );
}

nora_spi_i2s_tdm_inst_t* nora_spi_i2s_tdm_spi3( void )
{
    // NULL unless a conf.h instance row actually targets TDM_SPI3, so on CK64MC105 -- which
    // has no SPI3 -- this is NULL simply because nothing targets it. Note that is a property
    // of the instance list, NOT an enforced one: hw.c keeps a ZEROED [TDM_SPI3] facts row on
    // parts without SPI3, so a conf.h that named TDM_SPI3 on MC105 would build and then fail
    // at runtime on NULL register pointers. Making that a hard #error belongs with the
    // conf.h-ownership work (phase 5), not here.
    return tdm_find_leg_by_phys_spi( TDM_SPI3 );
}

nora_spi_i2s_tdm_inst_t* nora_spi_i2s_tdm_spi4( void )
{
    // Declared for contract completeness only: no supported dsPIC33CK part has a 4th SPI
    // (there is no TDM_SPI4 in tdm_spi_inst_t), so there is nothing to search for. NULL for
    // an absent instance is exactly what the canonical contract specifies.
    return NULL;
}


//===========================================================
// Last-error diagnostic (debug aid; see the header contract). Plain last-writer-wins
// store -- NOT updated from the ISR hot path and NOT stream health.
//===========================================================
static volatile nora_spi_i2s_tdm_error_t s_last_error = NORA_SPI_I2S_TDM_ERR_NONE;

static inline void tdm_set_error( nora_spi_i2s_tdm_error_t err )
{
    s_last_error = err;
}

nora_spi_i2s_tdm_error_t nora_spi_i2s_tdm_get_last_error( void )
{
    return s_last_error;
}


/*
 * Return one instance's current writable TX ping-pong half, or NULL.
 *
 * For an app that produces one instance's output from ANOTHER instance's block callback
 * -- e.g. a co-clocked dual-codec demo where SPI1's callback fills BOTH its own and
 * SPI2's TX so the two codecs stay sample-aligned (same block, same frame), with no
 * cross-ISR handoff or ordering/race dependency. The returned half is the one NOT being
 * transmitted (same selection the instance's own block callback receives as dst). Only
 * valid while inst is running, and only meaningful when called at a block boundary --
 * co-clocked siblings share the ping-pong phase, so SPI2's writable half then matches
 * SPI1's. Returns NULL if inst is NULL/stopped or the half cannot be resolved; the
 * caller must NULL-check before writing.
 */
nora_tdm_slot_t* nora_spi_i2s_tdm_inst_tx_fill_ptr( nora_spi_i2s_tdm_inst_t* inst )
{
    nora_tdm_slot_t* dst = NULL;

    if( ( inst == NULL ) || !inst->running )
    {
        return NULL;
    }
    // Per-leg pong-half offset = slots * blk (runtime path; the hot ISR uses a literal).
    tdm_get_dest_ptr( nora_dma_read_src( inst->tx_dma_ch ), inst->tx_buffer,
                      (uint32_t)inst->geom_slots_per_fs * inst->geom_block_frames, &dst );
    return dst;
}


