sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
/*
 * Return one instance's TX ping-pong half by MIRRORING a reference instance's fill half,
 * instead of reading this instance's own live DMA position.
 *
 * For the co-clocked single-producer dual-codec demo: leg A's block callback fills BOTH
 * codecs from the SAME callback. Using inst_tx_fill_ptr(B) there reads B's live TX DMA and
 * returns "the half not being transmitted NOW" -- a snapshot sampled at callback start that
 * can go stale (B crosses its own block boundary while the long callback runs) -> the write
 * lands in the half B is transmitting -> tearing under high load. Mirroring removes the live
 * read: the returned half is whichever half of THIS instance corresponds to the reference's
 * just-handed fill half (`ref_fill_half`, i.e. A's `dst`). Because two co-clocked legs share
 * the ping-pong phase and equal block geometry, the mirrored half is the correct (safe,
 * not-transmitting) half for the WHOLE block -- deterministic, no live-DMA snapshot, A and B
 * sample-aligned (same generation, zero skew).
 *
 * Returns a typed result (see the header enum). On OK, *dst = the writable (not-transmitting)
 * target half. On BAD_ARGUMENT (NULL arg / stopped inst / ref_fill_half outside ref's buffer),
 * UNSAFE_ACTIVE_HALF (inst is transmitting the target half NOW) or UNRESOLVED_DMA_POSITION
 * (inst's live TX-DMA address is out of buffer range -- reload boundary / just-started /
 * fault), *dst=NULL and the caller must NOT write the mirrored leg this block. The target half
 * itself is deterministic (from ref_fill_half); the live-DMA read is only the secondary veto
 * that produces UNSAFE/UNRESOLVED.
 *
 * Slot units, not DMA elements. Offsets below are SLOT counts and the pointer arithmetic is on
 * nora_tdm_slot_t, so this backend's 16-bit TX DMA element never leaks out: the raw DMAxSRC
 * address advances twice per slot, and the only place that matters is the address RANGE tests,
 * which stay in the integer domain against &tx_buffer[n] and therefore convert for free.
 */
nora_spi_i2s_tdm_mirror_result_t nora_spi_i2s_tdm_inst_tx_fill_mirror(
        nora_spi_i2s_tdm_inst_t*       inst,
        const nora_spi_i2s_tdm_inst_t* ref,
        const nora_tdm_slot_t*         ref_fill_half,
        nora_tdm_slot_t**              dst )
{
    if( dst == NULL )
    {
        return NORA_TDM_MIRROR_BAD_ARGUMENT;
    }
    *dst = NULL;   // fail-closed default: only OK sets a non-NULL pointer
    if( ( inst == NULL ) || ( ref == NULL ) || ( ref_fill_half == NULL ) )
    {
        return NORA_TDM_MIRROR_BAD_ARGUMENT;
    }
    // inst and ref must be handles returned by this HAL's accessors (spiN()/inst(i)).
    // tdm_spi_leg_is_valid() checks each descriptor's local invariants (known SPI instance,
    // distinct RX/TX channels, non-NULL buffers) before use; it is not a defense against an
    // arbitrary bogus pointer. Reject on that check or a stopped inst as BAD_ARGUMENT.
    if( !tdm_spi_leg_is_valid( inst ) || !tdm_spi_leg_is_valid( ref ) || !inst->running )
    {
        return NORA_TDM_MIRROR_BAD_ARGUMENT;
    }
    const uint32_t ref_half  = (uint32_t)ref->geom_slots_per_fs  * ref->geom_block_frames;
    const uint32_t inst_half = (uint32_t)inst->geom_slots_per_fs * inst->geom_block_frames;

    // Which half of ref is ref_fill_half? [base, base+ref_half) = ping (index 0); the pong half
    // starts at base+ref_half. Reject a pointer outside ref's [base, base+2*ref_half). Compare in
    // the integer domain (uintptr_t): comparing pointers into DIFFERENT array objects is undefined
    // in C, so a bogus ref_fill_half must be range-checked as an integer -- same idiom as
    // tdm_get_dest_ptr() and as the inst live-DMA address check below.
    const uintptr_t rbase = (uintptr_t)&ref->tx_buffer[ DMA_BUF_PING_POS ];
    const uintptr_t rmid  = (uintptr_t)&ref->tx_buffer[ ref_half ];
    const uintptr_t rend  = (uintptr_t)&ref->tx_buffer[ 2u * ref_half ];
    const uintptr_t raddr = (uintptr_t)ref_fill_half;
    if( ( raddr < rbase ) || ( raddr >= rend ) )
    {
        return NORA_TDM_MIRROR_BAD_ARGUMENT;
    }
    const bool     pong       = ( raddr >= rmid );
    const uint32_t target_off = pong ? inst_half : 0u;   // SLOTS: the half we would fill

    // Live safety veto. With a phase-locked start the mirrored (ref-fill) half is always inst's
    // NON-transmitting half. Two abnormal cases must NOT authorize a write:
    //   - live TX-DMA address OUT of inst's buffer (reload boundary / just-started / fault): the
    //     active half is UNRESOLVABLE -> fail-closed as UNRESOLVED (a caller tolerates a few
    //     consecutive as a transient and resyncs only if persistent).
    //   - live address IN range AND on the very half we'd fill: a real phase problem -> UNSAFE.
    const uintptr_t ibase = (uintptr_t)&inst->tx_buffer[ DMA_BUF_PING_POS ];
    const uintptr_t imid  = (uintptr_t)&inst->tx_buffer[ inst_half ];
    const uintptr_t iend  = (uintptr_t)&inst->tx_buffer[ 2u * inst_half ];
    // Out-of-line twin on purpose: this is a block-boundary API, not the RX-block ISR body, so
    // it follows inst_tx_fill_ptr() above rather than the `_hot` path (D6 -- by measured call
    // site, not by file).
    const uintptr_t iaddr = (uintptr_t)nora_dma_read_src( inst->tx_dma_ch );
    if( ( iaddr < ibase ) || ( iaddr >= iend ) )
    {
        return NORA_TDM_MIRROR_UNRESOLVED_DMA_POSITION;
    }
    const uint32_t active_off = ( iaddr >= imid ) ? inst_half : 0u;
    if( active_off == target_off )
    {
        return NORA_TDM_MIRROR_UNSAFE_ACTIVE_HALF;
    }
    *dst = inst->tx_buffer + target_off;
    return NORA_TDM_MIRROR_OK;
}


/*
 * Diagnostic: which TX ping-pong half is this instance's DMA CURRENTLY transmitting?
 *   0 = ping (first half), 1 = pong (second half), -1 = unresolved (stopped, or the live
 *   DMAxSRC snapshot is outside this buffer -- reload boundary / just-started / fault).
 *
 * Phase-probe use only (measure two co-clocked legs' ping-pong alignment for the
 * single-producer path). Reads the live DMA source address, so sample it at a deterministic
 * instant (e.g. a block-boundary ISR) and compare two co-clocked legs.
 */
int nora_spi_i2s_tdm_inst_tx_active_half( nora_spi_i2s_tdm_inst_t* inst )
{
    if( ( inst == NULL ) || !inst->running )
    {
        return -1;
    }
    const uint32_t  half = (uint32_t)inst->geom_slots_per_fs * inst->geom_block_frames;
    const uintptr_t base = (uintptr_t)&inst->tx_buffer[ DMA_BUF_PING_POS ];
    const uintptr_t mid  = (uintptr_t)&inst->tx_buffer[ half ];
    const uintptr_t end  = (uintptr_t)&inst->tx_buffer[ 2u * half ];
    const uintptr_t addr = (uintptr_t)nora_dma_read_src( inst->tx_dma_ch );

