sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
    if( ( addr < base ) || ( addr >= end ) )
    {
        return -1;
    }
    return ( addr >= mid ) ? 1 : 0;
}


/*
 * Diagnostic: the TX DMA's CURRENT read position as a SLOT offset into the full ping-pong
 * buffer [0, 2*half). Returns -1 if stopped or the live DMAxSRC snapshot is out of range.
 *
 * Finer than tx_active_half(): lets a phase probe measure the SUB-block sample offset between
 * two co-clocked legs (equal half but different position => a fixed offset that can still tear
 * a late cross-fill write). Sample at a deterministic instant and diff two legs.
 *
 * The unit is one SLOT, matching the contract, NOT this part's DMA element: the TX DMA moves
 * 16-bit wire words, so DMAxSRC advances TWICE per slot, and dividing by sizeof(nora_tdm_slot_t)
 * -- not by the element size -- is what makes a two-leg diff mean the same number of samples it
 * means on a family whose element is the whole slot. The truncating divide is deliberate: a
 * snapshot taken mid-slot (the low wire word already fetched) reports the slot it is inside.
 */
int32_t nora_spi_i2s_tdm_inst_tx_active_pos( nora_spi_i2s_tdm_inst_t* inst )
{
    if( ( inst == NULL ) || !inst->running )
    {
        return -1;
    }
    const uint32_t  half = (uint32_t)inst->geom_slots_per_fs * inst->geom_block_frames;
    const uintptr_t base = (uintptr_t)&inst->tx_buffer[ DMA_BUF_PING_POS ];
    const uintptr_t end  = (uintptr_t)&inst->tx_buffer[ 2u * half ];
    const uintptr_t addr = (uintptr_t)nora_dma_read_src( inst->tx_dma_ch );

    if( ( addr < base ) || ( addr >= end ) )
    {
        return -1;
    }
    return (int32_t)( ( addr - base ) / sizeof(nora_tdm_slot_t) );   // 0 .. 2*half-1
}


/*
 * Register or clear one SPI instance's audio-block callback.
 *
 * That instance's RX-block ISR calls this hook once per completed block. The update
 * is bracketed by briefly masking the instance's RX DMA IE so the ISR cannot observe
 * a torn cb/user pair.
 *
 * Returns false (and changes nothing) if the contract is violated: NULL inst, or the
 * instance is running and the call would CHANGE the (cb,user) pair -- the callback must
 * be registered before the leg is STARTED (inst_start() in SINGLE mode,
 * start_domain()/start_all_domains() in SYSTEM mode) and not swapped/cleared mid-stream.
 * This entry point itself has NO config-mode gate: a callback is per-instance state, not
 * part of the SINGLE/SYSTEM API split, so it is legal on any leg in either mode.
 * Re-registering
 * the identical (cb,user) while running is allowed (idempotent no-op -> true).
 */
bool nora_spi_i2s_tdm_set_block_callback( nora_spi_i2s_tdm_inst_t* inst,
                                               nora_spi_i2s_tdm_block_cb_t cb,
                                               void* user )
{
    bool     rxie_bak;

    if( inst == NULL )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }

    // While running, only a no-op re-register of the same pair is permitted.
    if( inst->running && ( cb != inst->block_cb || user != inst->block_user ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_ALREADY_RUNNING );
        return false;
    }

    rxie_bak = tdm_rx_ie_disable( inst->rx_dma_ch );

    inst->block_cb   = cb;
    inst->block_user = user;

    tdm_rx_ie_restore( inst->rx_dma_ch, rxie_bak );
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


/*
 * Open the shared board/clock port for the engine, ONCE, before any instance is started.
 *
 * Takes NO role argument: the clock role handed to the port hooks is DERIVED from the
 * committed block-timing reference leg, so the pin/clock direction can never disagree with
 * the configured stream. Until phase 2 the app passed the role, and nothing tied the value
 * it passed to the role it had committed in inst_configure() -- removing the argument
 * removes that bug class rather than just a parameter, which is why the caller-visible
 * change is worth its two call sites.
 *
 * Brings up + checks the external clock and routes pins/CLC through the registered
 * port hooks (all optional). Returns false if the block-timing reference is not configured
 * (ERR_NOT_CONFIGURED -- configure before open), the external clock cannot be brought up /
 * is not ready, or a pin/CLC hook rejects the role -- the caller must then not start any
 * instance. With no port registered this is a no-op success (self-clocked). It does
 * NOT block waiting for a clock (single readiness check) and does NOT touch any
 * SPI/DMA -- per-instance start arms the hardware. Co-clocked followers ride the same
 * clock/pins, which is why one role is enough for the engine.
 *
 * Idempotent: a second open() while already open succeeds without re-running the port
 * hooks. That is not an optimisation -- the hooks have side effects (external-clock
 * bring-up, CLC engage), and re-running them under a stream armed against the first
 * routing is what idempotence is protecting against.
 */
bool nora_spi_i2s_tdm_open( void )
{
    const tdm_stream_t  *stream = &s_stream;
    const tdm_spi_leg_t *timing_leg;
    nora_spi_i2s_tdm_clock_role_t role;

    // Already open: do NOT re-run the port hooks (see above), just succeed.
    if( s_stream.opened )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
        return true;
    }

    // Verify the shared-engine topology ONCE here, before any clock/pin bring-up:
    // exactly one block-timing reference (the first leg), distinct physical SPIs, and
    // distinct DMA channels across all legs. This catches a leg-table misconfig
    // (e.g. two legs on the same SPI, or a crossed DMA channel) that the per-leg
    // tdm_spi_leg_is_valid() check at configure/start cannot see.
    if( !tdm_stream_topology_is_valid( stream ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_TOPOLOGY );
        return false;
    }

    /*
     * Derive the clock role from the COMMITTED block-timing reference (never from a caller
     * argument). That leg MUST be configured: open() with an unconfigured reference is a
     * contract error, not a silent SLAVE default -- a silent default is precisely how a board
     * ends up pin-routed as a slave while its committed config says master.
     */
    timing_leg = tdm_stream_get_block_timing_master_leg( stream );
    if( ( timing_leg == NULL ) || !timing_leg->config_valid )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_NOT_CONFIGURED );
        return false;
    }
    role = timing_leg->config.clock_role;

