sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
    if( stream->port != NULL )
    {
        if( ( stream->port->clock_source_init != NULL ) && !stream->port->clock_source_init( role ) )
        {
            tdm_set_error( NORA_SPI_I2S_TDM_ERR_CLOCK_INIT );
            return false;   // external clock could not be brought up (e.g. unsupported role)
        }
        if( ( stream->port->clock_source_ready != NULL ) && !stream->port->clock_source_ready( role ) )
        {
            tdm_set_error( NORA_SPI_I2S_TDM_ERR_CLOCK_NOT_READY );
            return false;   // clock not ready yet -- caller retries open() later
        }
        if( ( stream->port->configure_pins != NULL ) && !stream->port->configure_pins( role ) )
        {
            tdm_set_error( NORA_SPI_I2S_TDM_ERR_PIN_CONFIG );
            return false;   // role this board cannot pin-route
        }
        if( ( stream->port->clc_passthrough != NULL ) && !stream->port->clc_passthrough( role ) )
        {
            tdm_set_error( NORA_SPI_I2S_TDM_ERR_CLC );
            return false;
        }
    }
    s_stream.opened = true;   // port up: start/arm may now proceed
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


/*
 * Close the shared port after all instances are stopped.
 *
 * Deliberately a near-no-op: like stop(), the HAL does NOT tear down PPS/CLC routing
 * or the external clock -- other peripherals (or the next open()/start()) may depend
 * on them, and the port has no deinit hook. Provided for lifecycle symmetry and as
 * the place a future clock-deinit hook would run.
 *
 * Rejected (false, STAYS OPEN) while any leg is still running: closing under a live stream
 * would make the lifecycle state (closed) disagree with the hardware (SPI/DMA still on), and
 * the next inst_start() would then be refused as ERR_NOT_OPEN on a stream that never stopped.
 * Stop every leg first (inst_stop). On success the open flag is cleared, so the next start
 * needs a fresh open() -- that is what makes stop -> close -> open -> start a real restart
 * rather than a sequence of no-ops.
 */
bool nora_spi_i2s_tdm_close( void )
{
    if( tdm_any_leg_running() )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_ALREADY_RUNNING );
        return false;
    }
    s_stream.opened = false;   // a fresh open() is required before the next start/arm
    // No hardware teardown by design (see above).
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


// The macro-derived default config lives in the platform layer -- see
// audio_app_board_get_default_config() in audio_app/. The core
// no longer fabricates a config from app macros; callers configure() explicitly.


/*
 * Store a validated configuration for ONE instance (declaration only; no HW write).
 *
 * This is the SINGLE-mode, PRIMARY-only per-leg entry. Rejected (false) if: the port is
 * already open()'d (ERR_ALREADY_OPEN -- configure BEFORE open, because open() now derives
 * the clock role from this very config and routing the pins for one role while the stored
 * config says the other is the disagreement phase 2 exists to make unreachable); the stream
 * was committed via configure_system() (mode == SYSTEM -> ERR_CONFIG_MODE; a system caller
 * stays transactional); inst is not the primary leg (ERR_CONFIG_MODE -- a non-primary leg is
 * reachable only through configure_system()); the instance is running or invalid; or cfg is
 * outside the supported wire-format envelope (NULL-safe). On success the config is stored and
 * the mode becomes SINGLE. Each leg carries its OWN clock role: this HAL does NOT force a
 * follower to SLAVE anywhere -- a follower is SLAVE because it was configured SLAVE, and the
 * stored role is what reaches the registers unchanged.
 *
 * The mode/primary gates sit AFTER the opened check, matching canonical: a call made while
 * RUNNING is answered ERR_ALREADY_OPEN, the same code it got before phase 3, so no existing
 * caller's diagnosis changes for a state that was already illegal.
 */
bool nora_spi_i2s_tdm_inst_configure( nora_spi_i2s_tdm_inst_t* inst,
                                           const nora_spi_i2s_tdm_config_t* cfg )
{
    // Reconfiguring a live instance would glitch (or tear) the framing mid-block; the
    // contract is stop -> configure -> start, so reject configure while running.
    if( inst == NULL )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    // Configure happens BEFORE open(): open() consumes this config to derive the clock role
    // and route pins/CLC, so configuring under an open port would desync HW from the config.
    if( s_stream.opened )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_ALREADY_OPEN );
        return false;
    }
    // Mode ownership: a SYSTEM-committed stream must be reconfigured only transactionally
    // (configure_system); and the per-leg API only ever addresses the PRIMARY leg. A
    // non-primary leg is configured exclusively through configure_system().
    if( s_config_mode == TDM_CONFIG_MODE_SYSTEM )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }
    if( !tdm_inst_is_primary( inst ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }
    if( inst->running )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_ALREADY_RUNNING );
        return false;
    }
    if( !tdm_spi_leg_is_valid( inst ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    if( cfg == NULL )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_ARGUMENT );
        return false;
    }
    if( !tdm_config_is_supported( inst, cfg ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_UNSUPPORTED_CONFIG );
        return false;
    }
    // The leg's sync_domain (from the conf.h seed here; configure_system() will overwrite it)
    // must fit the 0..31 range the domain mask in phase 4's start_all_domains() can track --
    // guard the per-leg path too. See also the conf.h SYNC_DOMAIN #error and the leg-table
    // compile assert: this runtime check exists for a domain set by a future caller, not by
    // the macros, so it cannot be a compile assert alone.
    if( inst->sync_domain >= 32u )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_TOPOLOGY );
        return false;
    }

    inst->config       = *cfg;
    inst->config_valid = true;
    s_config_mode      = TDM_CONFIG_MODE_SINGLE;   // per-leg primary API now owns the config
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


