sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
/*
 * Transactional whole-system configure. setups[i] targets leg index i; setup_count must
 * equal the built leg count (TDM_SPI_LEG_COUNT). See the header for the contract.
 *
 * Two passes, all-or-nothing:
 *   1. PREFLIGHT (zero side effects) -- every leg must be a valid descriptor, STOPPED, and
 *      its stream must pass tdm_config_is_supported; each sync domain may hold at most one
 *      clock MASTER; and legs sharing a sync domain must agree on the frame interpretation
 *      (tdm_domain_framing_matches). Any failure rejects the whole set before a leg is touched.
 *   2. COMMIT -- only after a clean preflight, store each leg's config + sync_domain +
 *      config_valid together. Because preflight already validated everything, commit cannot
 *      fail, so there is never a partially-configured mix (SPI1-new + SPI2-old).
 *
 * NO MODE CHECK, deliberately, and this is the one place in the family that has none. A full
 * recommit is legal from NONE, SINGLE or SYSTEM: this call is the only way out of SINGLE
 * ownership, so gating it on the mode would strand a stream that had ever used inst_configure()
 * with no route to the domain API. The safety comes from the other two gates instead -- the port
 * must be CLOSED (ERR_ALREADY_OPEN) and every leg must be STOPPED -- so a live stream is
 * rejected, not silently reshaped. Do NOT "fix" the asymmetry: the *tm exerciser asserts that
 * a RUNNING stream answers ERR_ALREADY_OPEN here and not ERR_CONFIG_MODE, precisely so that
 * adding a mode gate breaks a test instead of quietly removing the escape hatch.
 *
 * The caller owns stop->configure->start: this does NOT stop a running transport (it
 * rejects one via the STOPPED preflight), keeping the call side-effect-free on rejection.
 */
bool nora_spi_i2s_tdm_configure_system( const nora_spi_i2s_tdm_leg_setup_t* setups,
                                             uint8_t setup_count )
{
    if( ( setups == NULL ) || ( setup_count != (uint8_t)TDM_SPI_LEG_COUNT ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_ARGUMENT );
        return false;
    }
    // Configure happens BEFORE open() (open() consumes the committed config). A full recommit
    // is allowed from ANY mode (NONE/SINGLE/SYSTEM) as long as the port is closed and every
    // leg is stopped (the STOPPED preflight below enforces the latter).
    if( s_stream.opened )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_ALREADY_OPEN );
        return false;
    }

    // 1a. PREFLIGHT: each leg valid, stopped, and its stream supported. Zero side effects.
    for( uint8_t i = 0u; i < setup_count; i++ )
    {
        tdm_spi_leg_t* leg = nora_spi_i2s_tdm_inst( i );
        if( ( leg == NULL ) || !tdm_spi_leg_is_valid( leg ) )
        {
            tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
            return false;
        }
        if( leg->running )
        {
            tdm_set_error( NORA_SPI_I2S_TDM_ERR_ALREADY_RUNNING );
            return false;
        }
        if( !tdm_config_is_supported( leg, &setups[i].stream ) )
        {
            tdm_set_error( NORA_SPI_I2S_TDM_ERR_UNSUPPORTED_CONFIG );
            return false;
        }
        // sync_domain must fit the 0..31 range that start_all_domains()'s 32-bit dedup/rollback
        // mask can track. A domain id >= 32 would be silently dropped from the started-mask, so
        // its legs could be started twice or skipped on rollback. Reject at configure (fail
        // closed) rather than misbehave at start. (This board uses domain 0 only; the guard is
        // for public reuse, and the per-leg path in inst_configure() checks it too.)
        if( setups[i].sync_domain >= 32u )
        {
            tdm_set_error( NORA_SPI_I2S_TDM_ERR_TOPOLOGY );
            return false;
        }
    }

    // 1b. PREFLIGHT: at most one clock MASTER per sync domain (a domain has exactly one
    // clock source; two masters would fight for BCLK/FS -- and on CK they would also fight
    // for the single CLC1 FS generator).
    for( uint8_t i = 0u; i < setup_count; i++ )
    {
        if( setups[i].stream.clock_role != NORA_SPI_I2S_TDM_CLOCK_MASTER )
        {
            continue;
        }
        for( uint8_t j = (uint8_t)( i + 1u ); j < setup_count; j++ )
        {
            if( ( setups[j].sync_domain == setups[i].sync_domain ) &&
                ( setups[j].stream.clock_role == NORA_SPI_I2S_TDM_CLOCK_MASTER ) )
            {
                tdm_set_error( NORA_SPI_I2S_TDM_ERR_TOPOLOGY );
                return false;
            }
        }
    }

    // 1c. PREFLIGHT: legs sharing a sync domain are co-clocked on ONE BCLK/FS, so their frame
    // interpretation must be identical (a mismatch would read the shared clock differently on
    // each leg). See tdm_domain_framing_matches for the fields compared vs allowed to differ.
    for( uint8_t i = 0u; i < setup_count; i++ )
    {
        for( uint8_t j = (uint8_t)( i + 1u ); j < setup_count; j++ )
        {
            if( ( setups[j].sync_domain == setups[i].sync_domain ) &&
                !tdm_domain_framing_matches( &setups[i].stream, &setups[j].stream ) )
            {
                tdm_set_error( NORA_SPI_I2S_TDM_ERR_TOPOLOGY );
                return false;
            }
        }
    }

    // 2. COMMIT: preflight guarantees success, so store all legs together (config,
    // sync_domain, config_valid) -- the topology table is now the single source of both
    // the stream and the sync domain.
    for( uint8_t i = 0u; i < setup_count; i++ )
    {
        tdm_spi_leg_t* leg = nora_spi_i2s_tdm_inst( i );
        leg->config       = setups[i].stream;
        leg->sync_domain  = setups[i].sync_domain;
        leg->config_valid = true;
    }
    s_config_mode = TDM_CONFIG_MODE_SYSTEM;   // whole-system domain API now owns the config
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


/*
 * Read back ONE leg's committed setup: the config inst_configure() stored, plus the leg's
 * sync domain.
 *
 * PURE QUERY -- it deliberately does NOT call tdm_set_error(), not even on the failure paths.
 * A board port hook may call this from inside open() to route that leg's pins/CLC from the
 * committed clock role; if this query wrote the error channel it would erase the real failure
 * code the caller is about to read. "Returns false" is the whole report.
 *
 * The unconfigured leg returns false rather than a zeroed setup, because a zeroed clock_role
 * is a VALID role (SLAVE) -- a caller could not otherwise tell "not configured" from "slave".
 */
bool nora_spi_i2s_tdm_inst_get_setup( const nora_spi_i2s_tdm_inst_t* inst,
                                           nora_spi_i2s_tdm_leg_setup_t* setup )
{
    if( ( inst == NULL ) || ( setup == NULL ) || !inst->config_valid )
    {
        return false;
    }
    setup->stream      = inst->config;
    setup->sync_domain = inst->sync_domain;
    return true;
}




