sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
/*
 * Start ONE instance: arm its RX/TX DMA, then program + enable its SPI (triggers,
 * then module ON). The shared port must already be open()'d -- ENFORCED since phase 2
 * (ERR_NOT_OPEN), where before it was only documented: arming DMA/SPI with the port
 * unrouted enters SPIEN on a silently dead stream, so this fails closed.
 *
 * Returns false (instance left stopped, its HW rolled back) if the port is not open, the
 * clock source is no longer ready, it is not configured, already running, or DMA setup
 * fails. Does NOT touch the port or any other instance -- the caller orders multi-instance
 * starts (followers before the block-timing reference so all outputs are armed when the
 * block-timing reference's cadence begins).
 *
 * Validation order matches canonical: instance validity -> config mode -> primary -> opened ->
 * clock readiness -> configured -> already-running -> arm. opened is checked BEFORE readiness so
 * a start before open() reports ERR_NOT_OPEN rather than a readiness-hook verdict, and the
 * readiness RE-CHECK (the open->start drop window: open() checks once, and an external BCLK/FS
 * can vanish in between) only runs once open() has already brought the source up.
 *
 * The mode gate sits BEFORE opened -- the opposite order from inst_configure(), deliberately.
 * Under a SYSTEM-committed stream (or for a follower leg) this call is one the caller may not
 * make AT ALL, so answering ERR_NOT_OPEN would send them to open() to fix a call that open()
 * cannot make legal. Under a NEVER-configured stream (mode NONE) the same asymmetry shows: a
 * start before the first configure answers ERR_CONFIG_MODE, where after a configure+stop it
 * answers ERR_NOT_OPEN -- the same call, two verdicts, which is what makes the gate observable.
 */
bool nora_spi_i2s_tdm_inst_start( nora_spi_i2s_tdm_inst_t* inst )
{
    // Gate FIRST -- do not arm DMA/SPI unless this instance is actually going to run.
    if( ( inst == NULL ) || !tdm_spi_leg_is_valid( inst ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    if( ( s_config_mode != TDM_CONFIG_MODE_SINGLE ) || !tdm_inst_is_primary( inst ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }
    if( !s_stream.opened )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_NOT_OPEN );
        return false;
    }
    if( !tdm_stream_ready_for_start() )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_CLOCK_NOT_READY );
        return false;
    }

    // arm (everything up to but excluding SPIEN) then go (SPIEN). For a single leg the two
    // are adjacent, so this is exactly the old sequence; the split exists so start_domain()
    // can arm every leg first and release SPIEN back-to-back at the end.
    if( !tdm_inst_arm( inst ) )
    {
        return false;   // arm() already wrote the error and rolled its own HW back
    }
    tdm_inst_go( inst );

    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


/*
 * ARM one leg: everything the start needs EXCEPT turning the SPI module on.
 *
 * On success the leg's DMA channels are enabled and armed, its SPI registers are programmed,
 * its DMA-trigger events are on, the CLC 50%-FS generator is engaged (or released), and
 * SPIEN is still OFF -- so no clock/FS edge has been emitted and running is still false.
 * tdm_inst_go() is the only thing that finishes it.
 *
 * Validation here is the part that is per-LEG: BAD_INSTANCE -> NOT_CONFIGURED ->
 * ALREADY_RUNNING -> NOT_OPEN -> UNSUPPORTED_CONFIG -> the statl resolve. The stream-wide
 * gates (config mode, clock readiness) belong to the caller, because a domain start checks
 * them ONCE for the group rather than once per leg. NOT_OPEN is re-checked anyway: it is the
 * one stream-wide condition whose violation would arm a silently dead stream, and both
 * callers are cheap to double-check.
 *
 * Only inst_start()'s single-leg path can reach the ordering visible from one leg, so the
 * error-priority seen by a one-leg caller is unchanged from phase 3 by construction.
 *
 * The statl NULL check is a CK-specific seam and lives HERE, not in the caller: the pointer
 * must be published before either DMA channel or SPIEN is enabled, because the generated
 * vector reads it non-volatile. Arming is the last moment that is still race-free.
 */
static bool tdm_inst_arm( nora_spi_i2s_tdm_inst_t* inst )
{
    nora_spi_i2s_tdm_config_t eff_cfg;

    // config_valid implies the config already passed configure()'s envelope check.
    if( ( inst == NULL ) || !tdm_spi_leg_is_valid( inst ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    if( !inst->config_valid )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_NOT_CONFIGURED );
        return false;
    }
    if( inst->running )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_ALREADY_RUNNING );
        return false;
    }
    if( !s_stream.opened )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_NOT_OPEN );
        return false;
    }
    // Resolve the register-level config (a validated copy -- no role override; see the
    // helper's own comment).
    if( !tdm_spi_leg_get_effective_config( inst, &eff_cfg ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_UNSUPPORTED_CONFIG );
        return false;
    }

    /*
     * Resolve the physical SPI's status register before enabling either DMA
     * channel or SPIEN.  The generated vector cannot run before that point,
     * so the non-volatile pointer publication is race-free.  A valid static
     * leg must always resolve; retain this check so a future bad leg-table row
     * fails safely at start rather than dereferencing NULL in an ISR.
     */
    inst->spi_statl = nora_spi_i2s_tdm_hw_get_statl( inst->spi_inst );
    if( inst->spi_statl == NULL )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }

    // Fresh diagnostics + a deterministic first block for this instance.
    nora_spi_i2s_tdm_diag_reset( &inst->diag );
    tdm_inst_clear_buffers( inst );

    // Arm this instance's RX/TX DMA; on failure roll back ITS DMA/SPI so a partial
    // start leaves no channel with CHEN/IE set and the SPI off.
    if( !nora_spi_i2s_tdm_hw_dma_config( inst->spi_inst,
                                              inst->rx_dma_ch, inst->tx_dma_ch,
                                              inst->rx_buffer, inst->tx_buffer,
                                              inst->buffer_slot_count ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_DMA_CONFIG );
        goto fail;
    }

    // Program + enable this instance's SPI: registers, then DMA-trigger events, then
    // the module ON (ON is the last step, after the port pins/CLC are routed).
    nora_spi_i2s_tdm_hw_apply_config( inst->spi_inst, &eff_cfg );
    nora_spi_i2s_tdm_hw_dma_trigger_enable( inst->spi_inst, true );

    // FS_50PCT on a TDM master: the SPI emits a half-frame marker (set by apply_config);
    // engage CLC1 to toggle it into a 50%-duty FS on the same FS pin BEFORE the module
    // turns on, so the very first marker is captured. FS_PULSE and any slave (FS is an input)
    // need no CLC -- release it in case this instance held it before. I2S is absent from this
    // condition on purpose: I2S + MASTER + FS_50PCT never reaches start(), configure() having
    // already refused it (its FRMSYPW=1 pulse is 25%, not 50%, on a 16-bit wire).
    if( ( eff_cfg.clock_role   == NORA_SPI_I2S_TDM_CLOCK_MASTER ) &&
        ( eff_cfg.format == NORA_SPI_I2S_TDM_FORMAT_TDM )  &&
        ( eff_cfg.fs_shape == NORA_SPI_I2S_TDM_FS_50PCT ) )
    {
        const nora_spi_i2s_tdm_fs_clc_result_t clc =
            nora_spi_i2s_tdm_fs_clc_engage( inst->spi_inst );
        if( clc != NORA_SPI_I2S_TDM_FS_CLC_OK )
        {
            // BUSY = CLC1 already owned by another instance/domain; NO_FS_PIN = FS not on a
            // physical pin (or no CLC1 on this part).
            tdm_set_error( ( clc == NORA_SPI_I2S_TDM_FS_CLC_BUSY )
                               ? NORA_SPI_I2S_TDM_ERR_CLC
                               : NORA_SPI_I2S_TDM_ERR_PIN_CONFIG );
            goto fail;
        }
    }
    else
    {
        nora_spi_i2s_tdm_fs_clc_release( inst->spi_inst );
    }

