sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
    // Armed. SPIEN deliberately still OFF -- tdm_inst_go() releases it.
    return true;

fail:
    tdm_inst_soft_stop_dma( inst );
    tdm_inst_clear_dma_flags( inst );
    nora_spi_i2s_tdm_hw_soft_stop( inst->spi_inst );
    nora_spi_i2s_tdm_hw_irq_clear_flags( inst->spi_inst );
    inst->running = false;
    return false;
}


/*
 * GO: release SPIEN on an already-armed leg. Nothing else, and no validation -- the caller
 * armed this leg and therefore already knows it may run.
 *
 * Deliberately not public. The whole value of the split is that arm() can be called for
 * several legs and then go() for each in a chosen order (followers first, block-timing
 * master last), and that ordering guarantee only holds if no external caller can interleave.
 * hw_module_enable() is already the SPIEN-only writer, so no new hw primitive is needed.
 *
 * Cannot fail: SPIEN is a single bit write and the leg's error state was set by the caller.
 */
static void tdm_inst_go( nora_spi_i2s_tdm_inst_t* inst )
{
    nora_spi_i2s_tdm_hw_module_enable( inst->spi_inst, true );
    inst->running = true;
}




/*
 * Stop ONE instance and make its next start deterministic.
 *
 * SoftStop policy (per instance): does NOT stop DMACONbits.ON (shared controller) or
 * change PPS/CLC routing; stops only this instance's SPI module + DMA channels, masks
 * its DMA IRQs first so its ISR cannot refill mid-teardown, clears its pending
 * status, and clears its buffers so a restart is silent. Safe to call when stopped.
 *
 * Returns false for a bad handle (NULL / invalid leg) -- the case the void version already
 * refused to act on but could not report -- and with ERR_CONFIG_MODE when the stream was not
 * committed through inst_configure() or inst is not the primary leg (a SYSTEM-committed stream
 * is torn down through stop_domain/stop_all_domains, not one leg at a time). Otherwise the
 * teardown is idempotent, so a valid primary handle always returns true.
 *
 * Consequence, recorded rather than fixed: a stop before the FIRST configure (mode NONE) now
 * returns false/ERR_CONFIG_MODE where it used to return true. The only such caller is
 * wm8904_audio_stop(), which already discards the result with (void) -- and "you never
 * configured anything" is a more honest answer than a silent success.
 */
bool nora_spi_i2s_tdm_inst_stop( nora_spi_i2s_tdm_inst_t* inst )
{
    if( ( inst == NULL ) || !tdm_spi_leg_is_valid( inst ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    if( ( s_config_mode != TDM_CONFIG_MODE_SINGLE ) || !tdm_inst_is_primary( inst ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }

    tdm_inst_stop_impl( inst );
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


/*
 * The teardown itself, with NO validation and NO error write -- the caller has already
 * decided this leg may be stopped.
 *
 * Extracted so the group teardowns coming in phase 4 (stop_domain / stop_all_domains, and
 * start_domain's rollback path) tear a leg down through the SAME register order as
 * inst_stop() instead of a second copy of it. While inst_stop() is the only caller the
 * compiler inlines it back, so this costs nothing until phase 4 gives it a second caller.
 *
 * Idempotent by construction: every step is an unconditional "off"/clear, so stopping an
 * already-stopped leg is harmless -- which is what lets inst_stop() always report true for
 * a valid handle.
 */
static void tdm_inst_stop_impl( nora_spi_i2s_tdm_inst_t* inst )
{
    // Mark stopped up front so a per-instance running query sees the transition.
    inst->running = false;

    // DMA IRQs off + channels off first (no refill), then SPI module + triggers off.
    tdm_inst_soft_stop_dma( inst );
    nora_spi_i2s_tdm_hw_soft_stop( inst->spi_inst );

    // Release the CLC1 50%-FS generator if this instance owned it: the flip-flop is disabled
    // AND the external FS pad is routed back from CLC1OUT to its original FRMSYNC (SSx), so a
    // subsequent FS_PULSE start finds the SPI driving that pad directly again. The two
    // internal routes (FRMSYNC -> RPV0, CLCINA <- RPV0) are left in place -- they reach no pad
    // and re-engage re-asserts them. No-op if this instance did not own the CLC.
    nora_spi_i2s_tdm_fs_clc_release( inst->spi_inst );

    // Clear pending status/flags, then buffers, before the next start.
    tdm_inst_clear_dma_flags( inst );
    nora_spi_i2s_tdm_hw_irq_clear_flags( inst->spi_inst );
    tdm_inst_clear_buffers( inst );
}




/*
 * Do two legs sharing a sync domain agree on the BCLK/FS frame interpretation?
 *
 * Co-clocked legs (same sync_domain) ride ONE shared bit/frame clock, so the fields that
 * define HOW that shared clock is read must be identical on every member -- otherwise the
 * legs would sample the same wires with different framing. Compared: format, word_bits,
 * slots_per_fs, block_frames, fs_coincides_first_bclk (SPIFE), bclk_idle_high (CKP),
 * bclk_change_on_active_to_idle (CKE), AND fs_shape. fs_shape is compared because for I2S it
 * maps to FRMSYPW regardless of clock role (hw: FS_50PCT+I2S -> FRMSYPW=1, FS_PULSE -> 0), so
 * two co-clocked I2S legs with different fs_shape would read the SAME FS with different pulse
 * widths. Deliberately NOT compared (may legitimately differ per leg): clock_role (exactly one
 * master drives the shared clock, the rest are slaves), brg (a slave ignores it), and
 * mclk_enable. IGNROV/IGNTUR are HAL-fixed policies, not per-leg config fields.
 *
 * On CK the master-side FS_50PCT generator is CLC1 + virtual pin RPV0 (AK's sibling uses
 * CLC10 + RPV8), and it is a single shared resource -- which is why fs_clc_engage() can answer
 * BUSY, and why two masters in one domain are rejected before it is ever asked.
 */
static bool tdm_domain_framing_matches( const nora_spi_i2s_tdm_config_t* a,
                                        const nora_spi_i2s_tdm_config_t* b )
{
    return ( a->format                        == b->format ) &&
           ( a->word_bits                     == b->word_bits ) &&
           ( a->slots_per_fs                  == b->slots_per_fs ) &&
           ( a->block_frames                  == b->block_frames ) &&
           ( a->fs_coincides_first_bclk       == b->fs_coincides_first_bclk ) &&
           ( a->bclk_idle_high                == b->bclk_idle_high ) &&
           ( a->bclk_change_on_active_to_idle == b->bclk_change_on_active_to_idle ) &&
           ( a->fs_shape                      == b->fs_shape );
}


