sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
/*
 * Side-effect-free classification of one sync domain, shared by start_domain() (its preflight)
 * and start_all_domains() (its whole-set preflight). A sync domain is a phase-locked UNIT whose
 * INVARIANTS are re-checked at START -- not only in configure_system() -- because a member may
 * have been (re)configured via the per-leg path afterwards. Sets *err ONLY for INVALID.
 *   INVALID     : an unconfigured member (NOT_CONFIGURED), >1 clock MASTER (TOPOLOGY), a
 *                 same-domain framing disagreement (TOPOLOGY), or no member at all (BAD_INSTANCE).
 *   STOPPED     : every member configured + stopped -> startable.
 *   ALL_RUNNING : every member already running -> a start is an idempotent no-op.
 *   PARTIAL     : some-but-not-all members running -> reject WITHOUT teardown (a re-assert must
 *                 not kill live audio; a half-running domain is a foreign/inconsistent state).
 */
typedef enum {
    TDM_DOMAIN_INVALID = 0,
    TDM_DOMAIN_STOPPED,
    TDM_DOMAIN_ALL_RUNNING,
    TDM_DOMAIN_PARTIAL,
} tdm_domain_state_t;

static tdm_domain_state_t tdm_domain_classify( uint8_t domain,
                                               nora_spi_i2s_tdm_error_t *err )
{
    const uint8_t        n       = nora_spi_i2s_tdm_instance_count();
    const tdm_spi_leg_t *ref     = NULL;
    uint8_t              members = 0u;
    uint8_t              masters = 0u;
    uint8_t              running = 0u;

    for( uint8_t i = 0u; i < n; i++ )
    {
        const tdm_spi_leg_t *leg = nora_spi_i2s_tdm_inst( i );
        if( ( leg == NULL ) || ( leg->sync_domain != domain ) )
        {
            continue;
        }
        members++;
        if( !leg->config_valid )
        {
            *err = NORA_SPI_I2S_TDM_ERR_NOT_CONFIGURED;
            return TDM_DOMAIN_INVALID;
        }
        if( leg->config.clock_role == NORA_SPI_I2S_TDM_CLOCK_MASTER )
        {
            masters++;
        }
        if( leg->running )
        {
            running++;
        }
        if( ref == NULL )
        {
            ref = leg;
        }
        else if( !tdm_domain_framing_matches( &ref->config, &leg->config ) )
        {
            *err = NORA_SPI_I2S_TDM_ERR_TOPOLOGY;
            return TDM_DOMAIN_INVALID;
        }
    }
    if( members == 0u )
    {
        *err = NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE;
        return TDM_DOMAIN_INVALID;
    }
    if( masters > 1u )
    {
        *err = NORA_SPI_I2S_TDM_ERR_TOPOLOGY;
        return TDM_DOMAIN_INVALID;
    }
    if( running == 0u )
    {
        return TDM_DOMAIN_STOPPED;
    }
    return ( running == members ) ? TDM_DOMAIN_ALL_RUNNING : TDM_DOMAIN_PARTIAL;
}


/*
 * Mode-agnostic teardown of every leg in one sync domain (idempotent; safe on stopped legs).
 *
 * PRIVATE, and deliberately WITHOUT a config-mode gate, so start_domain()/start_all_domains()
 * can use it as their internal rollback and the public SYSTEM wrappers can use it as their
 * teardown. Every member goes down through the SAME per-leg register order as inst_stop().
 */
static void tdm_stop_domain_impl( uint8_t domain )
{
    const uint8_t n = nora_spi_i2s_tdm_instance_count();
    for( uint8_t i = 0u; i < n; i++ )
    {
        tdm_spi_leg_t* leg = nora_spi_i2s_tdm_inst( i );
        if( ( leg != NULL ) && ( leg->sync_domain == domain ) )
        {
            tdm_inst_stop_impl( leg );
        }
    }
}


/*
 * Mode-agnostic teardown of every instance, all sync domains. PRIVATE counterpart of the public
 * SYSTEM wrapper. Covers a future SPI3/SPI4 leg in any domain automatically because it walks the
 * leg table rather than a domain list. Idempotent; safe on already-stopped legs.
 */
static void tdm_stop_all_domains_impl( void )
{
    const uint8_t n = nora_spi_i2s_tdm_instance_count();
    for( uint8_t i = 0u; i < n; i++ )
    {
        tdm_spi_leg_t* leg = nora_spi_i2s_tdm_inst( i );
        if( leg != NULL )
        {
            tdm_inst_stop_impl( leg );
        }
    }
}


/*
 * Start every config_valid leg of one sync domain PHASE-LOCKED: (1) ARM all members, then
 * (2) release SPIEN back-to-back -- non-MASTER (slave/follower) legs first, the clock-MASTER
 * leg LAST. The adjacent go() calls make the members' ping-pong DMAs latch the same FS edge
 * (an external-FS domain has 0 masters -> all slaves go back-to-back; an internal-FS domain's
 * master starts its BCLK/FS only after the slaves are armed and listening).
 *
 * SYSTEM-mode API. Non-destructive: a fully-running domain is idempotent success; a partial or
 * invalid domain is rejected WITHOUT teardown -- a re-assert must never cut live audio, and a
 * half-running domain is a foreign state this call has no mandate to "repair". Returns false and
 * rolls back only THIS call's arms if a leg fails to arm. open() must have run first; this call
 * does not open anything.
 *
 * Gate order: CONFIG_MODE -> NOT_OPEN -> classify -> CLOCK_NOT_READY. Readiness is re-checked
 * ONCE for the group, after the classifier says STOPPED and immediately before arming, which is
 * the open->start drop window inst_start() re-checks for a single leg.
 */
bool nora_spi_i2s_tdm_start_domain( uint8_t domain )
{
    const uint8_t                 n = nora_spi_i2s_tdm_instance_count();
    nora_spi_i2s_tdm_error_t err;

    // SYSTEM-mode ownership: domain start is only for a configure_system()-committed stream.
    if( s_config_mode != TDM_CONFIG_MODE_SYSTEM )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }
    // open() (shared clock/pins/CLC + readiness) MUST have run first.
    if( !s_stream.opened )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_NOT_OPEN );
        return false;
    }

    // PREFLIGHT (zero side effects) via the shared classifier.
    const tdm_domain_state_t state = tdm_domain_classify( domain, &err );
    if( state == TDM_DOMAIN_INVALID )
    {
        tdm_set_error( err );
        return false;   // no side effects (do NOT stop_domain on a preflight reject)
    }
    if( state == TDM_DOMAIN_ALL_RUNNING )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
        return true;    // already fully up -> idempotent no-op success
    }
    if( state == TDM_DOMAIN_PARTIAL )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_ALREADY_RUNNING );
        return false;   // partial running -> reject, leave the domain as-is
    }

    // STOPPED and about to arm: re-check the clock-readiness gate (the open->start drop window).
    if( !tdm_stream_ready_for_start() )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_CLOCK_NOT_READY );
        return false;
    }

