sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
    // (1) ARM every member. Preflight guaranteed all are stopped + configured, so a failure
    //     here only rolls back what THIS call armed (the teardown is idempotent on stopped legs).
    for( uint8_t i = 0u; i < n; i++ )
    {
        tdm_spi_leg_t* leg = nora_spi_i2s_tdm_inst( i );
        if( ( leg == NULL ) || ( leg->sync_domain != domain ) )
        {
            continue;
        }
        if( !tdm_inst_arm( leg ) )
        {
            tdm_stop_domain_impl( domain );   // roll back only this call's arms (mode-agnostic)
            return false;                     // arm() already wrote the error
        }
    }

    // (2a) GO the non-master legs first (adjacent SPIEN releases).
    for( uint8_t i = 0u; i < n; i++ )
    {
        tdm_spi_leg_t* leg = nora_spi_i2s_tdm_inst( i );
        if( ( leg == NULL ) || ( leg->sync_domain != domain ) || !leg->config_valid )
        {
            continue;
        }
        if( leg->config.clock_role != NORA_SPI_I2S_TDM_CLOCK_MASTER )
        {
            tdm_inst_go( leg );
        }
    }
    // (2b) then the clock-MASTER leg LAST -- its BCLK/FS starts after the slaves listen.
    for( uint8_t i = 0u; i < n; i++ )
    {
        tdm_spi_leg_t* leg = nora_spi_i2s_tdm_inst( i );
        if( ( leg == NULL ) || ( leg->sync_domain != domain ) || !leg->config_valid )
        {
            continue;
        }
        if( leg->config.clock_role == NORA_SPI_I2S_TDM_CLOCK_MASTER )
        {
            tdm_inst_go( leg );
        }
    }
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


/*
 * Public SYSTEM-mode stop of one sync domain. Rejects (false, HW unchanged) unless the stream
 * was committed via configure_system() -- a SINGLE-mode stream tears down through inst_stop().
 *
 * Symmetric with start_domain() on the "unknown domain" question: an out-of-range (>= 32) or
 * MEMBER-LESS domain is ERR_BAD_INSTANCE, not a silent success. Stopping something that does not
 * exist is a caller bug worth reporting, and reporting it in both directions means a typo'd
 * domain id cannot read as "stopped fine". An existing but already-stopped domain is idempotent
 * true.
 */
bool nora_spi_i2s_tdm_stop_domain( uint8_t domain )
{
    if( s_config_mode != TDM_CONFIG_MODE_SYSTEM )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }
    if( domain >= 32u )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    // Reject a domain with no member leg (an unknown id), mirroring start_domain()'s
    // members == 0 check inside the classifier.
    uint8_t       members = 0u;
    const uint8_t n       = nora_spi_i2s_tdm_instance_count();
    for( uint8_t i = 0u; i < n; i++ )
    {
        const tdm_spi_leg_t *leg = nora_spi_i2s_tdm_inst( i );
        if( ( leg != NULL ) && ( leg->sync_domain == domain ) )
        {
            members++;
        }
    }
    if( members == 0u )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    tdm_stop_domain_impl( domain );
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


/*
 * Start every sync domain present in the leg table (each once). Start/rollback bookkeeping is
 * per-domain and there is no cross-domain start-ordering constraint here (NOTE: this is NOT full
 * independence -- source readiness is engine-wide / primary-leg-gated and shared resources such as
 * the FS_50PCT CLC and the board clock port are not per-domain; see tdm_stream_ready_for_start()).
 * SYSTEM-mode API. TWO PASSES so a later domain's failure can never tear down a domain that was
 * ALREADY running before this call (nor one this call did not touch):
 *   Pass 1 (side-effect-free): classify every DISTINCT domain. If ANY is PARTIAL or INVALID,
 *           reject the whole call touching NOTHING. Record which domains are STOPPED (startable).
 *           ALL_RUNNING domains are left running and are NOT recorded (never rolled back).
 *   Pass 2: start only the STOPPED domains, tracking newly_started_mask = domains THIS call
 *           actually started. On any failure, roll back ONLY newly_started_mask -- pre-existing
 *           running domains and untouched domains are preserved.
 * Returns false + ERR_NOT_CONFIGURED if no domain is configured. open() must run first.
 */
bool nora_spi_i2s_tdm_start_all_domains( void )
{
    const uint8_t                 n            = nora_spi_i2s_tdm_instance_count();
    uint32_t                      seen_mask    = 0u;   // distinct domains examined
    uint32_t                      stopped_mask = 0u;   // startable (all-stopped) domains
    nora_spi_i2s_tdm_error_t err;

    // SYSTEM-mode ownership + open() precondition.
    if( s_config_mode != TDM_CONFIG_MODE_SYSTEM )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }
    if( !s_stream.opened )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_NOT_OPEN );
        return false;
    }

    // PASS 1: classify every distinct configured domain, side-effect-free. Any PARTIAL/INVALID
    // domain rejects the whole call before a single leg is touched.
    for( uint8_t i = 0u; i < n; i++ )
    {
        const tdm_spi_leg_t* leg = nora_spi_i2s_tdm_inst( i );
        if( ( leg == NULL ) || !leg->config_valid )
        {
            continue;
        }
        const uint8_t dom = leg->sync_domain;
        if( ( dom >= 32u ) || ( ( seen_mask & ( 1uL << dom ) ) != 0u ) )
        {
            continue;   // >=32 is rejected at configure; skip duplicates
        }
        seen_mask |= ( 1uL << dom );

        const tdm_domain_state_t state = tdm_domain_classify( dom, &err );
        if( state == TDM_DOMAIN_INVALID )
        {
            tdm_set_error( err );
            return false;   // touch nothing
        }
        if( state == TDM_DOMAIN_PARTIAL )
        {
            tdm_set_error( NORA_SPI_I2S_TDM_ERR_ALREADY_RUNNING );
            return false;   // touch nothing (do NOT tear a half-running domain down)
        }
        if( state == TDM_DOMAIN_STOPPED )
        {
            stopped_mask |= ( 1uL << dom );
        }
        // ALL_RUNNING: leave it running, not recorded -> never rolled back.
    }
    if( seen_mask == 0u )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_NOT_CONFIGURED );
        return false;   // no configured domain to start
    }

    // PASS 2: start only the STOPPED domains; roll back ONLY what this call started.
    uint32_t newly_started_mask = 0u;
    for( uint8_t dom = 0u; dom < 32u; dom++ )
    {
        if( ( stopped_mask & ( 1uL << dom ) ) == 0u )
        {
            continue;
        }
        if( !nora_spi_i2s_tdm_start_domain( dom ) )
        {
            for( uint8_t d = 0u; d < 32u; d++ )
            {
                if( ( newly_started_mask & ( 1uL << d ) ) != 0u )
                {
                    tdm_stop_domain_impl( d );   // mode-agnostic; roll back only newly-started
                }
            }
            return false;   // pre-existing running domains untouched
        }
        newly_started_mask |= ( 1uL << dom );
    }
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


