sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
/*
 * Public SYSTEM-mode stop of every sync domain. Domain-level teardown counterpart to
 * start_all_domains() so callers never enumerate individual logical legs. Rejects
 * (false, HW unchanged) unless the stream was committed via configure_system() (mode==SYSTEM);
 * a SINGLE-mode stream tears down through inst_stop(). Idempotent success otherwise.
 */
bool nora_spi_i2s_tdm_stop_all_domains( void )
{
    if( s_config_mode != TDM_CONFIG_MODE_SYSTEM )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }
    tdm_stop_all_domains_impl();
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}




/*
 * Snapshot ONE instance's ISR load monitor.
 *
 * Values are updated from that instance's RX-block ISR, so its RX DMA IE is briefly
 * masked while reading the 32-bit counters on the 16-bit core. Returns false (NULL
 * args), or until at least one timed event exists and the high-resolution timer was
 * initialized. clear_peak resets min/max/event afterward.
 */
bool nora_spi_i2s_tdm_inst_get_load( nora_spi_i2s_tdm_inst_t* inst,
                                          nora_spi_i2s_tdm_load_t* monitor,
                                          bool clear_peak )
{
    bool     rxie_bak;
    bool     valid;

    if( ( inst == NULL ) || ( monitor == NULL ) )
    {
        return false;
    }

    // The diag counters are updated in this instance's RX-block ISR; mask its IE so
    // the snapshot + clear are consistent against the 16-bit core's non-atomic 32-bit
    // reads. The diag module itself does no masking.
    rxie_bak = tdm_rx_ie_disable( inst->rx_dma_ch );
    valid    = nora_spi_i2s_tdm_diag_get_load( &inst->diag, monitor, clear_peak );
    tdm_rx_ie_restore( inst->rx_dma_ch, rxie_bak );

    // Counts-to-microseconds AFTER the IE is restored. Three 64-bit divides inside
    // the mask made the window long enough to visibly delay the block ISR (paired
    // long/short block intervals summing to exactly two nominal periods, every time
    // the foreground sampled the load). The mask now covers only the raw snapshot
    // and clear, which is all that needs to be atomic against the ISR.
    nora_spi_i2s_tdm_diag_load_convert( monitor );

    return valid;
}


/*
 * Snapshot ONE instance's health/status.
 *
 * block_count, block_deadline_miss_count, load, and running are THIS instance's.
 * active is engine-wide (the shared clock/source readiness gate).
 */
bool nora_spi_i2s_tdm_inst_get_status( nora_spi_i2s_tdm_inst_t* inst,
                                            nora_spi_i2s_tdm_status_t* status,
                                            bool clear_peak )
{
    bool     rxie_bak;

    if( ( inst == NULL ) || ( status == NULL ) )
    {
        return false;
    }

    status->active  = nora_spi_i2s_tdm_is_active();   // shared clock/source readiness gate
    status->running = inst->running;                       // this instance's running state

    // 32-bit reads on a 16-bit core are not atomic vs this instance's RX-block ISR; mask briefly.
    rxie_bak = tdm_rx_ie_disable( inst->rx_dma_ch );
    nora_spi_i2s_tdm_diag_read_counts( &inst->diag,
                                            &status->block_count,
                                            &status->block_deadline_miss_count );
    // HW health counters read under the same mask (plain field copies, mirroring AK).
    status->rx_dma_overrun_count      = inst->diag.rx_dma_overrun_count;
    status->rx_dma_other_irq_count    = inst->diag.rx_dma_other_irq_count;
    status->rx_dma_last_status        = inst->diag.rx_dma_last_status;
    status->err_rov_block_count       = inst->diag.err_rov_block_count;
    status->err_tur_block_count       = inst->diag.err_tur_block_count;
    status->err_frm_block_count       = inst->diag.err_frm_block_count;
    status->frmerr_consecutive_blocks = inst->diag.frmerr_consecutive_blocks;
    tdm_rx_ie_restore( inst->rx_dma_ch, rxie_bak );

    // load monitor (does its own RX-IE guard; honours clear_peak)
    (void)nora_spi_i2s_tdm_inst_get_load( inst, &status->load, clear_peak );

    return true;
}


//===========================================================
// Engine-wide TDMsum profiler -- public wrappers.
//
// The profiler state is shared by EVERY leg's RX-block ISR, so a per-leg mask is not enough:
// each wrapper masks EVERY configured leg's RX DMA IE around the profiler call (the same
// bracket the per-leg readers use, generalised to all legs). The raw profiler ops in
// nora_spi_i2s_tdm_dspic33ck_diag.c do no masking themselves.
//
// The whole group -- wrappers, all-leg masking helpers, and the ISR enter/exit hooks in
// tdm_rx_block() -- is compiled only when NORA_TDM_SUMPROF is 1 (see
// nora_spi_i2s_tdm_conf.h).
//===========================================================
#if NORA_TDM_SUMPROF

// Disable every configured leg's RX DMA IE, saving prior enables into `bak[]` (indexed by leg).
static inline void tdm_all_rx_ie_disable( bool bak[TDM_SPI_LEG_COUNT] )
{
    uint8_t i;
    for( i = 0u; i < s_stream.leg_count; i++ )
    {
        bak[i] = tdm_rx_ie_disable( s_stream.legs[i].rx_dma_ch );
    }
}

// Restore every configured leg's RX DMA IE from `bak[]` (re-arms only those previously enabled).
static inline void tdm_all_rx_ie_restore( const bool bak[TDM_SPI_LEG_COUNT] )
{
    uint8_t i;
    for( i = 0u; i < s_stream.leg_count; i++ )
    {
        tdm_rx_ie_restore( s_stream.legs[i].rx_dma_ch, bak[i] );
    }
}

void nora_spi_i2s_tdm_tdmsum_configure( uint32_t window_period_ticks )
{
    bool bak[TDM_SPI_LEG_COUNT];
    const uint32_t now = nora_high_res_timer_get_count();

    tdm_all_rx_ie_disable( bak );
    nora_spi_i2s_tdm_dspic33ck_sumprof_configure( now, window_period_ticks );
    tdm_all_rx_ie_restore( bak );
}

void nora_spi_i2s_tdm_tdmsum_reset( void )
{
    bool bak[TDM_SPI_LEG_COUNT];
    const uint32_t now = nora_high_res_timer_get_count();

    tdm_all_rx_ie_disable( bak );
    nora_spi_i2s_tdm_dspic33ck_sumprof_reset( now );
    tdm_all_rx_ie_restore( bak );
}

bool nora_spi_i2s_tdm_tdmsum_get( nora_spi_i2s_tdm_tdmsum_t* out, bool clear_peak )
{
    bool bak[TDM_SPI_LEG_COUNT];

    if( out == NULL )
    {
        return false;
    }

    tdm_all_rx_ie_disable( bak );
    nora_spi_i2s_tdm_dspic33ck_sumprof_snapshot( out, clear_peak );
    tdm_all_rx_ie_restore( bak );

    return out->initialized;
}

