sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
#endif // NORA_TDM_SUMPROF


/*
 * Singleton load/status readers: report the block-timing-reference instance (SPI1).
 * Thin wrappers over the per-instance readers; behaviour is unchanged from before
 * the per-instance API was added.
 */
bool nora_spi_i2s_tdm_get_load( nora_spi_i2s_tdm_load_t* monitor, bool clear_peak )
{
    return nora_spi_i2s_tdm_inst_get_load( &s_spi_legs[TDM_SPI_LEG_BLOCK_REF], monitor, clear_peak );
}

bool nora_spi_i2s_tdm_get_status( nora_spi_i2s_tdm_status_t* status, bool clear_peak )
{
    return nora_spi_i2s_tdm_inst_get_status( &s_spi_legs[TDM_SPI_LEG_BLOCK_REF], status, clear_peak );
}


//===========================================================
// DMA INTERRUPT VECTORS  --  IMPORTANT: these ARE the IVT entries the CPU jumps to.
//
// The HAL ships its own DMA interrupt vectors so the transport is turnkey: link the HAL
// and the _DMAnInterrupt slots are filled, the DMA channels are already armed by
// start(), and the integrator only registers a per-instance block callback. (Previously
// these lived in a separate optional TU nora_spi_i2s_tdm_irq.c + a forwarding
// worker; folded back here -- no cross-TU hop -- since the toolchain/IVT coupling is
// confined to this one section.)
//
// One EXPLICIT RX vector per leg. The RX channel's vector runs that instance's block ISR
// (tdm_rx_block with THIS leg + its RX/TX channels + its slots*blk half size, ALL
// compile-time constants so the DMA register access / pointer math fold). The TX channel
// is INTENTIONALLY interrupt-less (hw.c enables the CPU IRQ on the RX channel only): TX is
// fire-and-forget ping-pong with auto-reload, so the RX completion alone defines the block
// boundary -- there is no TX ISR.
//
// The vector names are LITERAL and greppable (they were token-pasted before). At the
// default channel mapping (conf.h) this defines:
//     _DMA0Interrupt   (leg SPI1 RX, DMA0)
//     _DMA2Interrupt   (leg SPI2 RX, DMA2, when NORA_TDM_USE_SPI2)
// A conf.h remap (e.g. SPI1 -> DMA6) no longer moves the vector by itself: it trips the
// per-vector binding assert below, and the name must be changed here to match. IVT slots
// are chip-wide exclusive; a genuine clash surfaces as a duplicate-_DMAnInterrupt link
// error.
//
// IVT slots are chip-wide exclusive. If another subsystem must own one of these
// channels, REMAP the SPI to a free channel in conf.h (preferred -- the vector follows
// by token-paste); a genuine clash surfaces as a duplicate-_DMAnInterrupt link error.
//===========================================================

// One EXPLICIT RX interrupt vector per leg (was X-macro-generated by token-pasting the
// channel number into the vector name). tdm_rx_block is static inline (same TU) so the
// constant RX/TX channels + half size fold into the register access -- NO runtime
// channel->leg lookup. (tx) is still passed -- tdm_rx_block reads the TX channel's DMA
// address to pick the writable TX half -- but the TX channel itself raises no interrupt
// (interrupt-less; see above).
//
// The vector NAME encodes the DMA channel, and the name is now a LITERAL rather than
// pasted from the macro, so the two can disagree. Each vector is therefore bound to its
// conf.h RX-DMA channel by a compile-time assert immediately above it: remap a channel in
// conf.h and the build FAILS there until the vector name is updated to match. (Under the
// former token-paste the name followed the macro and could not disagree; the assert buys
// that guarantee back.)
//
// Compiled only when the HAL owns the IVT (NORA_TDM_DEFINE_DMA_VECTORS=1, default).
// With =0 the integrator owns the vectors and calls nora_spi_i2s_tdm_inst_rx_isr()
// (below) from their own _DMA<rx>Interrupt instead.
#if NORA_TDM_DEFINE_DMA_VECTORS
TDM_COMPILEASSERT( (NORA_TDM_SPI1_RX_DMA) == 0 );   /* leg SPI1 RX -> _DMA0Interrupt */
void __attribute__((__interrupt__, no_auto_psv)) _DMA0Interrupt(void)
{
    tdm_rx_block( &s_spi_legs[TDM_SPI_LEG_SPI1],
                  NORA_TDM_SPI1_RX_DMA, NORA_TDM_SPI1_TX_DMA,
                  TDM_LEG_HALF_SLOTS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) );
}
#if NORA_TDM_USE_SPI2
TDM_COMPILEASSERT( (NORA_TDM_SPI2_RX_DMA) == 2 );   /* leg SPI2 RX -> _DMA2Interrupt */
void __attribute__((__interrupt__, no_auto_psv)) _DMA2Interrupt(void)
{
    tdm_rx_block( &s_spi_legs[TDM_SPI_LEG_SPI2],
                  NORA_TDM_SPI2_RX_DMA, NORA_TDM_SPI2_TX_DMA,
                  TDM_LEG_HALF_SLOTS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) );
}
#endif // NORA_TDM_USE_SPI2
#endif // NORA_TDM_DEFINE_DMA_VECTORS

/*
 * Public RX-block ISR entry for ONE instance (vector-ownership opt-out path).
 *
 * Runs the same block work as the HAL's own generated vector, but is a plain (non-
 * interrupt) function the integrator calls from their OWN _DMA<rx>Interrupt when
 * NORA_TDM_DEFINE_DMA_VECTORS=0. Channels + half size come from the leg at runtime
 * (the generated turnkey vectors fold them as constants; this dispatch trades that for
 * IVT ownership). NULL inst is ignored. Call it for the instance's RX channel only --
 * TX is interrupt-less.
 */
void nora_spi_i2s_tdm_inst_rx_isr( nora_spi_i2s_tdm_inst_t* inst )
{
    if( inst == NULL )
    {
        return;
    }
    tdm_rx_block( inst, inst->rx_dma_ch, inst->tx_dma_ch,
                  (uint32_t)inst->geom_slots_per_fs * (uint32_t)inst->geom_block_frames );
}


//===========================================================
// Local Function
//===========================================================

/*
 * Clear one instance's DMA ping-pong buffers (RX + TX).
 *
 * This covers transport buffers only. Application DSP work buffers live in
 * audio_app.c and are deliberately outside the HAL's ownership boundary.
 */
static void tdm_inst_clear_buffers( const tdm_spi_leg_t *leg )
{
    if( leg == NULL )
    {
        return;
    }
    tdm_zero_memory( leg->tx_buffer, leg->buffer_slot_count * sizeof(leg->tx_buffer[0]) );
    tdm_zero_memory( leg->rx_buffer, leg->buffer_slot_count * sizeof(leg->rx_buffer[0]) );
}


