sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
/*
 * Tiny local memset(0) helper.
 *
 * Keeps this embedded HAL independent of the C library's memset implementation
 * and safely accepts NULL for callers that are already walking descriptor tables.
 */
static void tdm_zero_memory(void *ptr, size_t bytes)
{
    uint8_t *p = (uint8_t *)ptr;

    if( p == NULL )
    {
        return;
    }

    while( bytes > 0u )
    {
        *p = 0u;
        p++;
        bytes--;
    }
}


/*
 * Stop one instance's DMA activity.
 *
 * Its RX/TX interrupts are masked first so the ISR cannot refill buffers while the
 * channels are being disabled. The DMA controller global ON state is intentionally
 * untouched because other subsystems may be using DMA.
 */
static void tdm_inst_soft_stop_dma( const tdm_spi_leg_t *leg )
{
    if( leg == NULL )
    {
        return;
    }
    nora_dma_irq_enable( leg->rx_dma_ch, false );
    nora_dma_irq_enable( leg->tx_dma_ch, false );
    (void)nora_dma_channel_enable( leg->rx_dma_ch, false );
    (void)nora_dma_channel_enable( leg->tx_dma_ch, false );
}


/*
 * Clear one instance's pending DMA status and CPU interrupt flags.
 *
 * Status is cleared before IRQ flags so stale HALF/DONE conditions cannot
 * immediately retrigger on the next start.
 */
static void tdm_inst_clear_dma_flags( const tdm_spi_leg_t *leg )
{
    if( leg == NULL )
    {
        return;
    }
    nora_dma_clear_status( leg->rx_dma_ch );
    nora_dma_clear_status( leg->tx_dma_ch );
    nora_dma_clear_irq_flag( leg->rx_dma_ch );
    nora_dma_clear_irq_flag( leg->tx_dma_ch );
}


/*
 * Validate one private SPI leg descriptor.
 *
 * Checks only descriptor-local invariants: a known SPI instance, distinct RX/TX
 * DMA channels, non-NULL buffers, and a non-zero buffer length. Cross-leg
 * singleton rules are enforced by tdm_stream_topology_is_valid().
 */
static bool tdm_spi_leg_is_valid( const tdm_spi_leg_t *leg )
{
    if( leg == NULL )
    {
        return false;
    }
    if( (unsigned)leg->spi_inst >= (unsigned)TDM_SPI_INST_COUNT )
    {
        return false;
    }
    if( leg->rx_dma_ch == leg->tx_dma_ch )
    {
        return false;
    }
    if( ( leg->rx_buffer == NULL ) || ( leg->tx_buffer == NULL ) )
    {
        return false;
    }
    if( leg->buffer_slot_count == 0u )
    {
        return false;
    }
    return true;
}


/*
 * Validate the private stream topology.
 *
 * Generic over the instance count (1..TDM_SPI_INST_COUNT): every leg is descriptor-
 * valid, EXACTLY ONE leg is the block-timing REFERENCE, and that reference is the first
 * leg (TDM_SPI_LEG_BLOCK_REF -- the row is_running()/the singleton get_status()/is_active()
 * report). All legs use distinct physical SPIs and distinct DMA channels (cross-leg loop
 * below). The physical SPI and the RX/TX DMA channels per leg come from the instance
 * descriptor list (conf.h); NOTHING here is pinned to a specific SPI number or channel,
 * so adding an instance or remapping a leg's channels needs no edit to this check.
 *
 * The "exactly one reference, at leg 0" rule is KEPT deliberately: the stream is still
 * co-clocked and the singleton reporting API needs one primary leg. It is NOT a
 * clock-role constraint (clock role is per-leg, P3 Stage 1). It generalizes to truly
 * independent per-instance timing when per-instance clocks land (P3 Stage 2), not before.
 */
static bool tdm_stream_topology_is_valid( const tdm_stream_t *stream )
{
    uint8_t timing_ref_count = 0u;
    const tdm_spi_leg_t *timing_leg = NULL;

    if( ( stream == NULL ) ||
        ( stream->legs == NULL ) ||
        ( stream->leg_count == 0u ) ||
        ( stream->leg_count > (uint8_t)TDM_SPI_INST_COUNT ) )
    {
        return false;
    }

    for( uint8_t i = 0u; i < stream->leg_count; i++ )
    {
        const tdm_spi_leg_t *leg = &stream->legs[i];

        if( !tdm_spi_leg_is_valid( leg ) )
        {
            return false;
        }
        if( leg->is_block_timing_master )
        {
            timing_ref_count++;
        }
    }
    if( timing_ref_count != 1u )
    {
        return false;
    }

    // The single block-timing reference must be the first leg (TDM_SPI_LEG_BLOCK_REF): its RX
    // ISR defines the block boundary and is what is_running()/get_status() report.
    timing_leg = tdm_stream_get_block_timing_master_leg( stream );
    if( ( timing_leg == NULL ) ||
        ( timing_leg != &stream->legs[TDM_SPI_LEG_BLOCK_REF] ) )
    {
        return false;
    }

    for( uint8_t i = 0u; i < stream->leg_count; i++ )
    {
        for( uint8_t j = (uint8_t)(i + 1u); j < stream->leg_count; j++ )
        {
            const tdm_spi_leg_t *a = &stream->legs[i];
            const tdm_spi_leg_t *b = &stream->legs[j];

            if( a->spi_inst == b->spi_inst )
            {
                return false;
            }
            if( ( a->rx_dma_ch == b->rx_dma_ch ) ||
                ( a->rx_dma_ch == b->tx_dma_ch ) ||
                ( a->tx_dma_ch == b->rx_dma_ch ) ||
                ( a->tx_dma_ch == b->tx_dma_ch ) )
            {
                return false;
            }
        }
    }

    return true;
}


/*
 * Find the single block-timing-reference SPI leg.
 *
 * Returns NULL if the table has no reference or more than one. The timing
 * leg is the row whose RX DMA interrupt defines block completion and invokes the
 * application's block callback.
 */
static const tdm_spi_leg_t *tdm_stream_get_block_timing_master_leg( const tdm_stream_t *stream )
{
    const tdm_spi_leg_t *timing_leg = NULL;

    if( ( stream == NULL ) || ( stream->legs == NULL ) )
    {
        return NULL;
    }

    for( uint8_t i = 0u; i < stream->leg_count; i++ )
    {
        if( stream->legs[i].is_block_timing_master )
        {
            if( timing_leg != NULL )
            {
                return NULL;
            }
            timing_leg = &stream->legs[i];
        }
    }

    return timing_leg;
}


/*
 * Build the hardware-applied config for one SPI leg.
 *
 * Just a validated copy of the leg's stored config -- each leg carries its OWN clock
 * role (master/slave), so there is no stream-wide role override here. A follower is
 * SLAVE because the integrator configured it SLAVE (it rides the shared clock), not
 * because the HAL forces it; an instance on an independent clock can be its own master.
 */
static bool tdm_spi_leg_get_effective_config( const tdm_spi_leg_t *leg,
                                              nora_spi_i2s_tdm_config_t *effective_cfg )
{
    if( ( effective_cfg == NULL ) || !tdm_spi_leg_is_valid( leg ) || !leg->config_valid )
    {
        return false;
    }

