sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
    *effective_cfg = leg->config;
    return true;
}








// Deadline-miss, ISR load/time, and the debug scope-GPIO/printf instrumentation
// that used to live here (local_dma_debug_check / _start / _end) now live in the
// separated diagnostics module (nora_spi_i2s_tdm_diag.*), reached through
// nora_spi_i2s_tdm_diag_check_deadline / _isr_begin / _isr_end.









/*
 * Resolve the RX ping-pong half completed by the DMA status snapshot.
 *
 * Output is NULL when the status does not identify a usable half or when inputs
 * are invalid. The returned pointer is into the HAL-owned RX buffer and is passed
 * read-only to the application block callback.
 */
static inline void tdm_get_src_ptr( nora_dma_status_t    dma_stat,
                                      const nora_tdm_slot_t* const pRxDat,
                                      uint32_t             half_pos,
                                      const nora_tdm_slot_t**      src_pptr )
{
    if( src_pptr == NULL )
    {
        return;
    }
    *src_pptr = NULL;

    if( pRxDat == NULL )
    {
        return;
    }

    // half_pos = this instance's ping/pong half size in SLOTS (slots * blk).
    switch( nora_dma_half_from_status_hot( dma_stat ) )
    {
    case NORA_DMA_HALF_FIRST:
        // SW can use Ping(A) side buffer.
        //////////////////////////////////////
        *src_pptr  = &pRxDat[ DMA_BUF_PING_POS ];
        break;

    case NORA_DMA_HALF_SECOND:
        // SW can use Pong(B) side buffer.
        //////////////////////////////////////
        *src_pptr  = &pRxDat[ half_pos ];
        break;

    default:
        break;
    }
}

/*
 * Resolve the TX ping-pong half that software may safely fill next.
 *
 * The active DMA source address tells which half DMA is currently reading; the
 * helper returns the opposite half. Output is NULL when inputs are invalid.
 */
static inline void tdm_get_dest_ptr( uint32_t       dma_tx_addr,
                                       nora_tdm_slot_t* const pTxDat,
                                       uint32_t       half_pos,
                                       nora_tdm_slot_t**      dest_pptr )
{
    if( dest_pptr == NULL )
    {
        return;
    }
    *dest_pptr = NULL;

    if( pTxDat == NULL )
    {
        return;
    }

    // half_pos = this instance's ping/pong half size in SLOTS (slots * blk). The buffer
    // is [base, end) = pTxDat[0 .. 2*half_pos); the pong half starts at pTxDat[half_pos].
    // GUARD: the active TX-DMA source address must actually lie inside this buffer. At a
    // reload boundary, just after stop, on the first block, or in a fault, DMAxSRC can
    // hold an out-of-range value -- a bare ">= mid" test would then misclassify the half
    // and hand back a pointer to the half DMA is transmitting. Out of range -> NULL (the
    // caller NULL-checks and skips this block's fill).
    const uintptr_t base = (uintptr_t)&pTxDat[ DMA_BUF_PING_POS ];
    const uintptr_t mid  = (uintptr_t)&pTxDat[ half_pos ];
    const uintptr_t end  = (uintptr_t)&pTxDat[ 2u * half_pos ];
    const uintptr_t addr = (uintptr_t)dma_tx_addr;   // DMAxSRC snapshot as an address

    if( ( addr < base ) || ( addr >= end ) )
    {
        return;   // *dest_pptr stays NULL
    }

    if( addr >= mid )
    {
        // DMA is reading the Pong half -> SW fills Ping
        *dest_pptr = (nora_tdm_slot_t*)&pTxDat[ DMA_BUF_PING_POS ];
    }
    else
    {
        // DMA is reading the Ping half -> SW fills Pong
        *dest_pptr = (nora_tdm_slot_t*)&pTxDat[ half_pos ];
    }
}


/*
 * Validate the configuration envelope for ONE instance.
 *
 * The HAL accepts only what it can actually program/size: 32-bit words; geometry
 * (slots_per_fs / block_frames) that MATCHES this leg's compile-time buffer geometry
 * (its Rx_<name>/Tx_<name> are sized for exactly that, per the instance list); an
 * explicit role; and a framing the FRMCNT path supports -- I2S with 2 slots, or TDM
 * with 4/8/16 slots. This keeps configure() from programming untested framing or a
 * geometry the static buffers were not sized for.
 *
 * It also rejects the ONE combination the HAL would answer with a lying success:
 * I2S + MASTER + FS_50PCT, whose generated FS is 25% duty on a 16-bit wire. See the
 * fs_shape block at the end of this function.
 *
 * TDM32 (32 slots/FS) is unsupported. The serial wire
 * word is 16 bits, so a 32-bit slot is two wire words and FS cadence is measured in wire
 * words: 32 slots needs FRMCNT to encode 64, and the field stops at 32 (log2 -> 5). This
 * is a real capability loss, not a tidy-up -- it is stated here rather than left to be
 * discovered as a configure() that returns false for no visible reason. 16 slots x 32 bit
 * = 32 wire words is the widest TDM this part can frame. Recovering TDM32 would mean
 * 16-bit slots (word_bits = 16, one wire word per slot), which the rest of the HAL does
 * not currently support.
 */
static bool tdm_config_is_supported( const tdm_spi_leg_t* leg, const nora_spi_i2s_tdm_config_t* cfg )
{
    if( ( cfg == NULL ) || ( leg == NULL ) )  return false;

    if( cfg->word_bits != 32u )         return false;
    // Geometry must match THIS leg's compile-time (statically allocated) geometry.
    if( cfg->slots_per_fs != leg->geom_slots_per_fs ) return false;
    if( cfg->block_frames != leg->geom_block_frames ) return false;

    // role must be an explicit SLAVE or MASTER -- otherwise a garbage value would be
    // silently treated as SLAVE everywhere (role == MASTER ? ... : SLAVE).
    if( ( cfg->clock_role != NORA_SPI_I2S_TDM_CLOCK_SLAVE ) &&
        ( cfg->clock_role != NORA_SPI_I2S_TDM_CLOCK_MASTER ) )
    {
        return false;
    }

    if( cfg->format == NORA_SPI_I2S_TDM_FORMAT_I2S )
    {
        if( cfg->slots_per_fs != 2u )   return false;        // I2S = 2 slots (L/R)
    }
    else if( cfg->format == NORA_SPI_I2S_TDM_FORMAT_TDM )
    {
        // TDM: FS cadence is FRMCNT-encoded in WIRE WORDS (2 per 32-bit slot), and FRMCNT
        // tops out at 32 wire words -- so 4/8/16 slots, NOT 32. See the header comment.
        if( ( cfg->slots_per_fs != 4u ) && ( cfg->slots_per_fs != 8u ) &&
            ( cfg->slots_per_fs != 16u ) )
        {
            return false;
        }
    }
    else
    {
        return false;
    }

    // fs_shape must be a known value -- otherwise a garbage value would be silently
    // treated as FS_PULSE by hw_apply_config (shape == FS_50PCT ? ... : ...).
    if( ( cfg->fs_shape != NORA_SPI_I2S_TDM_FS_PULSE ) &&
        ( cfg->fs_shape != NORA_SPI_I2S_TDM_FS_50PCT ) )
    {
        return false;
    }

