sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
    // I2S + MASTER + FS_50PCT is REJECTED, and the reject is the point: this leg is the one
    // combination where the HAL would GENERATE a frame sync whose duty does not match the
    // shape the caller asked for. The wire word is 16 bits, so the
    // FRMSYPW=1 pulse hw_apply_config() programs for I2S is 16 BCLK out of a 64-BCLK
    // (2 x 32-bit) frame = 25%, not 50%. Returning true here would hand back a SUCCESS for a
    // 50%-duty request and then emit 25% -- a lying success is worse than a refusal, because
    // nothing downstream can detect it. The fix is the same CLC half-frame-marker route the
    // TDM master path already uses; until that exists and has been seen on a scope, this
    // combination is unsupported rather than silently wrong.
    //
    // Everything else stays accepted, deliberately:
    //   - I2S + SLAVE + FS_50PCT: FS is an INPUT, so the HAL generates no waveform and makes
    //     no duty claim. FRMSYPW still describes how the incoming FS is read, which is why
    //     fs_shape remains a compared framing field within a sync domain.
    //   - TDM (any role) + FS_50PCT: the master gets a real ~50% FS from CLC1 (measured); a
    //     TDM slave receives FS as an input and hw_apply_config treats it as normal framing.
    if( ( cfg->format     == NORA_SPI_I2S_TDM_FORMAT_I2S ) &&
        ( cfg->clock_role == NORA_SPI_I2S_TDM_CLOCK_MASTER ) &&
        ( cfg->fs_shape   == NORA_SPI_I2S_TDM_FS_50PCT ) )
    {
        return false;
    }

    // Note: sample rate is NOT part of the transport envelope -- the core is
    // rate-agnostic (runs at the configured BRG / external clock). The product's
    // supported-rate policy lives in the app layer (APP_SAMPLE_RATE_IS_SUPPORTED), not here.
    return true;
}


/*
 * Read-and-clear / restore the CPU interrupt enable of an instance's RX DMA channel.
 *
 * Used to bracket non-atomic updates against the instance's RX-block ISR. Channel-
 * generic (via the DMA HAL), so it follows whatever DMA channel an instance is mapped
 * to in conf.h -- no per-channel hardcode. Returns the prior IE state; restore re-arms
 * only if it was enabled (so masking before start() leaves the IE off).
 */
static inline bool tdm_rx_ie_disable( nora_dma_channel_t rx_dma_ch )
{
    return nora_dma_irq_disable_save( rx_dma_ch );
}

static inline void tdm_rx_ie_restore( nora_dma_channel_t rx_dma_ch, bool was_enabled )
{
    nora_dma_irq_restore( rx_dma_ch, was_enabled );
}


/*
 * One SPI instance's RX-block ISR body (generic).
 *
 * Snapshots the instance's RX DMA status, maps the just-completed RX half and the
 * writable TX half of THIS instance, then invokes THIS instance's callback with
 * (src, dst, user). Called from the generated per-instance RX vector (the
 * _DMA<rx>Interrupt section above), which passes this instance's leg + channels.
 *
 * The generated-vector callers pass compile-time constants.  `always_inline`
 * (on both declaration and definition) is required here: -Os previously chose
 * to outline this body, which silently turned those values back into runtime
 * arguments and retained the generic DMA switch path.  The public
 * inst_rx_isr() fallback may still use runtime values; it is an integrator-owned
 * vector path, not the EV88G73A's performance-critical default.
 */
static inline __attribute__((always_inline)) void
tdm_rx_block( tdm_spi_leg_t* inst, nora_dma_channel_t rx_ch, nora_dma_channel_t tx_ch, uint32_t half_pos )
{
          nora_dma_status_t  dma_stat;
    const nora_tdm_slot_t*  src_ptr = NULL;
          nora_tdm_slot_t*  dst_ptr = NULL;
          bool      time_this_block;

    // Engine-wide TDMsum union hook. Bracketing the whole body, so SPI1 and SPI2 add into one
    // common-window occupancy. Gated on the same high-res-timer availability as the per-leg
    // monitor; sum_meas is stable across this ISR so enter/exit stay balanced on every return
    // path.
    //
    // NOT gated on time_this_block: the per-leg monitor is sampled (1 block in 2^N, see
    // NORA_TDM_ISR_TIMING_SAMPLE_LOG2) and a UNION occupancy cannot be sampled -- a window
    // whose peak fell in an unmeasured block would read low. So this pays two timer reads on
    // EVERY block, which is exactly what NORA_TDM_SUMPROF=0 buys back (hook, timer read and
    // all): the hooks cost ISR cycles whether or not anyone ever calls _tdmsum_get().
#if NORA_TDM_SUMPROF
    const bool sum_meas = nora_high_res_timer_is_initialized();
    if( sum_meas )
    {
        nora_spi_i2s_tdm_dspic33ck_sumprof_enter( nora_high_res_timer_get_count() );
    }
#endif

    // Safety diagnostics below stay exact on EVERY block.  Only the costly
    // timer-based execution-time profiler is sampled (default 1/16) because
    // it needs two coherent 32-bit timer reads plus volatile 32-bit min/max
    // bookkeeping.  The resulting TDM max is explicitly a sampled peak.
    time_this_block = nora_spi_i2s_tdm_diag_should_time_this_block( &inst->diag );
    if( time_this_block )
    {
        nora_spi_i2s_tdm_diag_isr_begin( &inst->diag );
    }

    dma_stat = nora_dma_isr_snapshot_hot( rx_ch );

    // Preserve the raw RX-DMA cause (esp. OVRUNIF) BEFORE the half/pointer early-returns
    // below: an overrun-only snapshot maps to no completed half and would otherwise be lost.
    // This tiny header-inline hook replaces an out-of-line call but keeps the same
    // status/counter semantics, including the overrun-only early-return case.
    nora_spi_i2s_tdm_diag_note_dma_status_hot( &inst->diag, dma_stat );

    // Stream-health check; diagnostic print is debug-only. Each instance counts its
    // own deadline misses in its own diag (no shared/master counter).  Avoid the
    // former out-of-line helper call on the clean path, but retain that helper for
    // the rare fault so ENA_TDM_DBG still prints the same DMA/channel evidence.
    if( nora_dma_status_has_half_done_conflict_hot( dma_stat ) )
    {
        nora_spi_i2s_tdm_diag_check_deadline( &inst->diag, rx_ch, dma_stat );
    }

    // Map this instance's completed RX half (callback input) and the TX half it may
    // fill (callback output). Each instance handles only its own RX/TX -- no dst_b.
    tdm_get_src_ptr( dma_stat, inst->rx_buffer, half_pos, &src_ptr );
    if( src_ptr == NULL )
    {
        if( time_this_block )
        {
            nora_spi_i2s_tdm_diag_isr_end( &inst->diag );
        }
#if NORA_TDM_SUMPROF
        if( sum_meas )
        {
            nora_spi_i2s_tdm_dspic33ck_sumprof_exit( nora_high_res_timer_get_count() );
        }
#endif
        return;
    }
    tdm_get_dest_ptr( nora_dma_read_src_hot( tx_ch ), inst->tx_buffer, half_pos, &dst_ptr );
    if( dst_ptr == NULL )
    {
        // TX-DMA source is out of the buffer envelope (reload boundary / just-stopped /
        // first block / fault): there is no writable TX half this block. Skip rather than
        // hand the callback a NULL dst -- the public contract is that dst is always valid
        // when block_cb runs. (Mirrors the src_ptr guard above.)
        if( time_this_block )
        {
            nora_spi_i2s_tdm_diag_isr_end( &inst->diag );
        }
#if NORA_TDM_SUMPROF
        if( sum_meas )
        {
            nora_spi_i2s_tdm_dspic33ck_sumprof_exit( nora_high_res_timer_get_count() );
        }
#endif
        return;
    }

