sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck.c
    nora_spi_i2s_tdm_diag_note_block_hot( &inst->diag ); // exact completed-block count

    // Sample + ack this instance's framed-transport health once per completed block. Passing
    // it every block (even a clean one) is what lets frmerr_consecutive_blocks reset, so a
    // one-off glitch does not read as a permanent frame slip.  `spi_statl` was validated and
    // cached before inst_start() enabled DMA/SPI, so this is a header-inline volatile
    // read/W0C-ack sequence -- not an enum/table lookup plus out-of-line function call.
    // The helper deliberately preserves every-block observation and the W0C-safe semantics;
    // this is a function-boundary optimization, not a diagnostic-quality trade-off.
    nora_spi_i2s_tdm_diag_note_errflags_hot( &inst->diag,
        nora_spi_i2s_tdm_hw_sample_ack_errflags_hot( inst->spi_statl ) );

    // Deliver the completed block through this instance's registered callback. The
    // callee owns its DSP work buffers; the driver passes only this instance's
    // selected RX/TX ping-pong halves (both guaranteed non-NULL here). No callback ->
    // no app/DSP path: start() zeroes the TX half so a fresh start is silent until a
    // callback fills it (clearing the callback mid-stream leaves the last TX data looping).
    if( inst->block_cb != NULL )
    {
        inst->block_cb( src_ptr, dst_ptr, inst->block_user );
    }

    if( time_this_block )
    {
        nora_spi_i2s_tdm_diag_isr_end( &inst->diag );
    }
#if NORA_TDM_SUMPROF
    if( sum_meas )
    {
        nora_spi_i2s_tdm_dspic33ck_sumprof_exit( nora_high_res_timer_get_count() );
    }
#endif
}


// The demo/application audio path (local_copy_to_CODEC,
// local_drc_df2t_path, local_filter_cascade_chm) and the optional PWM audio
// output live in the demo app (audio_app.c). The HAL core does NOT
// call them: each instance's RX-block handler delivers its block to the registered
// block callback only (no app fallback). The HAL core owns the DMA ping-pong buffers;
// the demo app owns its f_*_Data DSP work buffers.
